[
  {
    "id": "3642235",
    "title": "Path of Exile 2: Upcoming Changes and Improvements",
    "date": "Dec 16, 2024, 10:11:50 PM",
    "url": "https://www.pathofexile.com/forum/view-thread/3642235",
    "content": "<div class=\"lbox-container\">\n    <div class=\"lbox\">\n        <div class=\"box-content s-pad\">\n<img src=\"https://web.poecdn.com/public/news/2024-12-17/UpcomingChangesHeader.jpg\">\n</div>\n    </div>\n</div><div class=\"lbox-container\">\n    <div class=\"lbox\">\n        <div class=\"box-content m-pad\">\nPath of Exile 2 has been live for just over a week! We’ve addressed some feedback already and are working on more fixes for key pain points in an upcoming patch. The full patch notes are coming soon, but check out some of the more significant changes below. \n<br><br>\n<h2>Gameplay Features</h2>\n<br>\nLike we mentioned last week, we’ll be adding the capacity to fast-travel between Checkpoints within an area, as well as adding many more checkpoints to areas, generally at all entrances and exits to areas, meaning if you find these first you’ll be able to instantly travel to them to continue exploring. \n<br><br>\nWe’ll also be making Passive Point respeccing cheaper especially at higher levels. It had a relatively aggressive curve getting more expensive with character level, we have flattened that curve so it doesn’t exponentially grow as much. This should generally result in approximately 40-50% less gold cost for respeccing between the start and middle of endgame progression. \n<br><br>\n<h2>Trial of the Sekhemas</h2>\n<br>\nPlayers were finding Trial of the Sekhemas particularly frustrating in close range so we’ve reworked how Honour Damage scales when in close range, as well as fixing an important bug that was causing players to take far too much Honour Damage from Damage over Time.\n<br><br>\n<ul>\n<li>Honour Damage now scales down based on distance to enemies, when in close range you’ll take 35% less Honour Damage, tapering off as you are further away from Monsters. </li>\n<li>Fixed a bug where Damage over Time was dealing thrice as much damage to Honour as intended, and fixed a bug where Honour Resistance was only applying to two-thirds of that damage. (This was confusing for us too) </li>\n<li>Skitter Golems no longer use basic attacks and instead now just explode.</li>\n<li>Serpent Clans burrow and ambush attack now has improved visual telegraphing and cannot be used from as far away. </li>\n<li>Volcanoes created by Rattlecage’s Fissure Slam now last half the duration. </li>\n</ul>\n<br><br>\n<h2>Endgame and Monster Balance</h2>\n<br>\nGenerally the balance in Endgame Maps was more punishing than intended, so we’ve toned down the damage in a number of ways and disabled a certain on-death effect where the telegraphing was not as clear as it should have been.\n<br><br>\n<ul>\n<li>Maps no longer have additional elemental resistance penalties inherently applied at Tier 6 and Tier 11 or higher Maps. It is now consistent across all of the Endgame.</li>\n<li>Chaos Damage now also scales less aggressively over the Endgame. </li>\n<li>Critical Strikes from monsters now deal 40% less bonus Damage. </li>\n<li>Lowered the baseline monster density of Breach Encounters, primarily by reducing the frequency of the “Elite” monsters appearing. </li>\n<li>Disabled the Volatile Crystals Modifier, we’ll revisit this in the future pending telegraphing improvements. </li>\n<li>Purple Explosives created by the Volatile Plants Modifier on Rare Monsters now deal significantly less Damage. </li>\n<li>The Siphons Flask Charges Modifier on Monsters now drains ten-times less Flask Charges per second. (This was unintentionally draining way too many charges)</li>\n</ul>\n<br>\nThese changes should generally result in an endgame that is much more survivable than before and we will continue to address problematic cases as they arise.\n<br><br>\n\n<h2>Character and Item Balance</h2>\n<br>\n<ul>\n<li>We’ve made Charm Modifiers on Belts substantially more common and now appear at much lower levels. The \"of Symbolism\" Modifier now appears from level 23 onwards, and the \"of Inscription\" Modifier now appears from level 64 onwards.</li>\n<li>Electrocute is now 25% harder to buildup. (But the Damage Penalty has been removed from the Support Gem).</li>\n<li>Added a new Lightning Damage and Electrocute Cluster to the passive tree in between the Ranger and Monk sections.</li>\n<li>It is now more difficult to chain-freeze enemies by reducing the amount of Freeze Buildup applied after a Freeze has been applied.</li>\n<li>The Hunter's Talisman Notable now grants +1 Charm Slot. The small passive skills leading up to it now grant the stat it formerly gave. The Charm helper text has been updated to indicate that you cannot have more than three Charm Slots unlocked, so that we can add more sources of it in the future.</li>\n</ul>\n<br><br>\n<h2>Skill and Support Gem Balance</h2>\n<br>\nSince launch we’ve unfortunately had to nerf a few skills that were far too overpowered. How do we define overpowered? Basically it's a situation in which a certain skill is so powerful that players feel no other method of playing the game is viable.\n<br><br>\nGenerally speaking we are trying to do this in a way that doesn't make a build bad (but we can make mistakes!). Ideally any truly meta shifting changes will only happen at the same time as a content patch with a new league to play in.\n<br><br>\nBut that doesn't mean we haven't been looking at underpowered skills and support gems. We’ve got a number of changes planned which should improve some of these skills. The full list of changes will be in the patch notes but here is a sample of what you can expect. \n<br><br>\n<ul>\n<li>Improvements to Rolling Slam and all Shield Skills in the Mace section.</li>\n<li>Improvements to various Bow Skills, especially the skills used to generate Frenzy Charges.</li>\n<li>Improvements to Bone Spells and Chaos Damage over Time Spells in the Occult section.</li>\n<li>Improvements to various Crossbow Skills, especially those at higher Tiers.</li>\n<li>Improvements to some of the underachieving Quarterstaff abilities.</li>\n</ul>\n<br>\nAlongside all of these Skill Gem improvements we’ve also done a pass over the Support Gems. We’ve added two new Supports and removed or lessened the penalties on many others, notably the Fire, Lightning and Cold Exposure Supports. \n<br><br>\n<ul>\n<li>Added the Tremors Support Gem. Which can be used to give up to multiple more Aftershocks to Skills, with a damage penalty.</li>\n<li>Added the Bidding Support Gem. Which can be used to give more damage to the Command Skills of Supported Minions.</li>\n<li>The Fire Exposure, Lightning Exposure and Cold Exposure Support Gems no longer penalize Damage of Supported Skills. They now have a Mana Cost Multiplier of 120%.</li>\n</ul>\n<br>\n<strong>There are also some notable nerfs to a few of the remaining overachieving skills:</strong>\n<br><br>\n<ul>\n<li>Skeletal Arsonists Spirit costs now match the other two Skeleton Mages, this should result in a slight decrease in the number of Arsonists at a higher level. </li>\n<li>A nerf to the damage over time component on very high levels of Tornado and Vine Arrow. These were never intended to be dealing damage themselves, but more so act as a way for other skills to propagate damage.</li>\n<li>Magnetic Salvo can now only use your stuck Lightning Arrows as opposed to those created by your Party Members.</li>\n</ul>\n<br><br>\nAs we wind down for the holiday season we wanted to thank you all for our most successful launch so far, we could not have done it without all of your support. A lot of our team will begin to take some much needed rest over the next few weeks but we look forward to getting back in the new year refreshed and ready for an exciting year of development in 2025. Happy Holidays, Exiles!</div>\n    </div>\n</div>",
    "author": "Community_Team",
    "replies": 2296,
    "lastReplyBy": "boowa86#1517",
    "lastReplyDate": "Jan 7, 2025, 12:10:59 PM",
    "type": "announcement",
    "imageUrl": "https://web.poecdn.com/public/news/2024-12-17/UpcomingChangesHeader.jpg"
  },
  {
    "id": "3611705",
    "title": "Addressing your Early Access Post-launch Feedback",
    "date": "Dec 10, 2024, 5:35:38 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3611705",
    "content": "<div class=\"lbox-container\">\n    <div class=\"lbox\">\n        <div class=\"box-content s-pad\">\n<img src=\"https://web.poecdn.com/public/news/2024-12-10/AddressingFeedbackHeader2.jpg\">\n</div>\n    </div>\n</div><div class=\"lbox-container\">\n    <div class=\"lbox\">\n        <div class=\"box-content m-pad\">\n\nHi everyone. The launch weekend has been a blast. We've really enjoyed seeing all of you get your hands on the game and finally try out the project we have been working on for so long.\n<br><br>\nBut now that the launch weekend is over it's time for us to look at the feedback and make some changes. There are lots more things coming. The list in this post are some of the things we felt needed to be more urgently addressed.\n<br><br>\nSome of these changes have already been deployed without a realm restart, others will be deployed in an upcoming patch.\n<br><br>\n<h2>Dodge Roll Changes</h2>\nA lot of players have expressed frustration about being trapped in by monsters. While it is intended that monsters are able to trap and kill you, we felt that the frequency of this was a little too high.\n<br><br>\nWe will be deploying the following changes in an upcoming patch:\n<ul>\n<li>Player size is now set to Zero units while dodge rolling instead of One unit</li>\n<li>Some smaller monsters can now be pushed while dodge rolling. This includes monsters such as the Adorned Beetles in Keth.</li>\n</ul><br>\n\nThis should result in getting trapped less often. \n<br><br>\nNote that you can still be trapped. A player size of a zero can still not phase through monsters, but it can get through even the smallest gap between them.\n<br><br>\n<h2>Checkpoint Changes</h2>\nA lot of players have been reporting that it can be tedious to need to retread areas of maps in order to get back to objectives that they already found.\n<br><br>\n\nWe will be deploying the following change in an upcoming patch:\n<ul>\n<li>Clicking on a checkpoint will allow you to teleport to other checkpoints in the area that are explored on your minimap</li>\n<li>Checkpoints have been added to all entrances and exits of zones to allow for teleportation</li>\n<li>A Checkpoint has been added to the midpoint of the first Dreadnaught area</li>\n</ul><br>\nWe will be making further adjustments to checkpoint positions as we continue to gather feedback.\n<br><br>\n<h2>Item Changes</h2>\n\nOne of the major problems that players have been experiencing is feeling that the game is not rewarding enough. This is an area that we have to be very careful when adjusting because it's very hard to reduce drops if we increase them by too much.\n<br><br>\nWe have identified a few key areas that we believe will significantly improve the experience that players are having.\n<br><br>\n<h3>Rare Monster Changes</h3>\n\nWe felt that Rare monsters were not rewarding enough. This didn't affect the campaign as much because there are more Unique bosses, increasing the overall amount of drops, but it's especially noticeable when playing in the endgame where Unique monsters are less common.\n<br><br>\nIn particular, the reward that you were getting for the increased difficulty of rares wasn't lining up.\n<br><br>\nWe have deployed the following changes:\n<ul>\n<li>Rarity bonus per rare mod has been doubled</li>\n<li>+10% Quantity bonus per rare mod</li>\n<li>Increased the chance of rare monsters inherently having more modifiers as you progress through endgame</li>\n</ul><br>\nThese changes will cause rare monster rewards to naturally scale up as you get to higher levels because the number of mods a monster can have increases throughout the campaign and into endgame. In addition, many other forms of map juicing will indirectly cause rare monsters to have more mods as well, increasing the rewards of these other mechanics too. Also note the change below to make sure each map has a minimum number of rares which will also increase the average number of rare mods, and thus increasing drops further.\n<br><br>\n<h3>Currency Changes</h3>\n\nWe felt that players were not getting enough of certain currency either in the early game, or to sustain adding mods to maps.\n<br><br>\n\nWe have deployed the following changes:\n<ul>\n<li>Regal orb drop rates increased around 40%</li>\n<li>Disenchanting of six mod rares to give two regal shards instead of one.</li>\n<li>Lesser Jewellers orbs drop rates increased around 33%</li>\n<li>Reduced the drop rate of Chaos Orbs slightly as they are less valued and so that it doesn't consume so much of the \"rare currency\" drop pool. This causes currency such as Exalted Orbs to increase somewhat.</li>\n<li>Gemcutter's Prism drop rates increased by 500%</li>\n<li>Gemcutter's Prisms now increase quality on gems by 5% instead of 1%</li>\n</ul><br>\n\n<h3>Map Mod Changes</h3>\nLike with rares, we felt that players were not being rewarded enough for the difficulty that was being added by map mods. We have significantly increased the value of all prefix map mods.\n<br><br>\nWe have changed all map prefix mods, but some example changes we have deployed are:\n<ul>\n<li>Rarity mods have been increased by 2.5x</li>\n<li>Quantity mods have had extra rarity added to them (This is now in a later patch)</li>\n<li>We removed the bottom tier of some mods</li>\n<li>You are much more likely to roll modifiers that affect drops or pack size rather than less useful mods</li>\n</ul><br>\n\nIn addition, it has been identified that some areas are not being affected by the \"Increased Number of Monster Packs\" mod as they should be. We will be fixing these maps to work correctly in a later patch.\n<br><br>\n<h3>\"Unlucky\" Drop Protection</h3>\nOne of the major issues we have identified are outlier \"unlucky\" drops. A single Unique boss dropping badly, especially early on can significantly affect your character.\n<br><br>\n\nWe have deployed the following changes:\n<ul>\n<li>No more than 50% of an Unique monsters drops can be gold</li>\n<li>Act Bosses and Map Bosses will always drop at least 1 rare</li>\n</ul><br>\n\nThe first of these changes is more significant than it first appears because players can't see the difference between \"normal\" and \"rare\" gold piles. You will get more equipment and currency items which can take more advantage of the rarity increases that unique monsters provide.\n<br><br>\n<h2>Click to Move</h2>\nThere was an issue where the \"Move Only\" command was namelocking. This would often result in your character confusingly attacking in an unexpected direction while holding down this action.\n<br><br>\n\nWe have deployed the following change:\n<ul>\n<li>Move Only no longer namelocks</li>\n</ul><br>\n<h2>Endgame Maps</h2>\nA concern for players in endgame maps is accidentally missing Rare monsters. In addition, many maps did not have the number of rare monsters that they should have had.\n<br><br>\nWe will be making the following changes in an upcoming patch:\n<ul>\n<li>Rare monsters now appear on the minimap when there are 200 monsters remaining, instead of 50</li>\n<li>Many maps have had additional rare monsters added to them to make sure that there are a minimum number in every map type.</li>\n</ul><br>\n\nOver the coming weeks we will be continuing to work on map layouts and monster density issues in maps.\n<br><br>\n\n<h2>Conclusion</h2>\nWe will be posting patch notes for these changes when they're deployed. For a full list of what's just been deployed, check out the patch notes <a href=\"https://www.pathofexile.com/forum/view-thread/3611708\">here</a>.\n<br><br>\nThere are still a lot more changes to come, these are just some of the changes that are fast for us to make. We will be continuing to monitor feedback and adjusting things as we go.</div>\n    </div>\n</div>",
    "author": "Community_Team",
    "replies": 1054,
    "lastReplyBy": "Bacon_Overlord#1834",
    "lastReplyDate": "Jan 7, 2025, 7:12:00 AM",
    "type": "announcement",
    "imageUrl": "https://web.poecdn.com/public/news/2024-12-10/AddressingFeedbackHeader2.jpg"
  },
  {
    "id": "3594080",
    "title": "Path of Exile 2 Early Access Launch - Live Updates 🔴",
    "date": "Dec 6, 2024, 6:16:03 PM",
    "url": "https://www.pathofexile.com/forum/view-thread/3594080",
    "content": "<div class=\"lbox-container\">\n    <div class=\"lbox\">\n        <div class=\"box-content m-pad\">\n<h1>Path of Exile 2 Early Access Launch - Live Updates 🔴</h1><br>\n<a href=\"https://pathofexile2.com/early-access\">Path of Exile 2</a> has launched into Early Access! We'll be updating this thread live throughout the day with any relevant info you may need about the game's deployment. You can also follow us on <a href=\"https://www.twitter.com/pathofexile\">X</a> for updates if the site is unavailable. The times below are displayed in your local time but you will need to be logged in to view them. The latest updates will be at the top.\n<br><br>\nIf you want to join Early Access, check out the new <a href=\"https://pathofexile2.com/buy-packs\">Supporter Packs</a>. These packs provide you with access to the early access release as well as many exclusive microtransactions and even physical goods. Thank you for your continued support!\n<br><br><hr><br>\n<h3>Path of Exile 2 Early Access Day 3</h3>\n<br><br>\n<strong>Dec 08, 2024 9:20 PM (GMT)</strong> - We're aware of some players having issues logging into their characters. We are investigating this.\n<br><br>\n\n<strong>Dec 09, 2024 2:00 AM (GMT)</strong> - Currently, it's a bit too easy to detonate Gas Cloud explosions when combined with persistent Ignite skills like Flame Wall. We'll be adjusting the explosion damage of both Gas Grenade and Gas Arrow for now in an upcoming hotfix.\n<br><br>\nIn the future, we want to update it such that the potency of the Ignite or Detonator contributes to determining the damage of the Gas Cloud explosions, that way we would be able to avoid balancing around the simplest and most efficient way to apply Ignites.this.\n<br><br>\n\n<h3>Path of Exile 2 Early Access Day 2</h3>\n<br><br>\n<strong>Dec 08, 2024 7:15 AM (GMT)</strong> - We've found another skill in an unacceptable balance state. Following the same ideals as earlier, we're also going to be reducing the damage of Magnetic Salvo in the next hotfix. Note that this isn't the only skill on our radar right now but we're really just trying to address egregious cases at the moment. We're currently playing alongside you all and are also collating a lot of your feedback that we'll be addressing as much as possible in the upcoming week once the team is back in the office before the holidays. Thanks Exiles! \n<br><br>\n<strong>Dec 07, 2024 9:04 PM (GMT)</strong> - Well we've finally hit that point where a skill with unacceptable balance has been discovered! Supercharged Slam is unfortunately dealing far too much damage than was intended given the short channel window required to hit maximum stages. We are imminently going to be reducing its damage. As much as we are trying to avoid nerfing skills and builds, it is better to do this early before it feels obligatory to use the skill. It is important that a wide variety of skills feel viable and fun to play and it simply diminishes all other abilities when one is clearly outshining the others like this. We will be starting with a heavy damage reduction on the ability in the next hotfix, which should be out within an hour. At a later time we will be making further adjustments to how long it takes to build up charges, as it is far too quick at the moment.\n<br><br>\n<h3>Path of Exile 2 Early Access Day 1</h3>\n<br><br>\n<strong>Dec 06, 2024 11:37 PM (GMT)</strong> - For anyone who purchased Path of Exile 2 on Steam, we've resolved the issue and the purchase queue should be processed in about 15 minutes. \n<br><br>\n<strong>Dec 06, 2024 11:28 PM (GMT)</strong> - We should have a fix out soon for players purchasing Path of Exile 2 through Steam being unable to login.  \n<br><br>\n<strong>Dec 06, 2024 10:29 PM (GMT)</strong> - We're aware of players being unable to claim their Steam keys due to the Path of Exile website being down. Our website team currently has this as their top priority and have a plan of action to restore this service to allow you to play the game! A huge thanks for the grace being displayed by those affected.  \n<br><br>\n<strong>Dec 06, 2024 10:10 PM (GMT)</strong> - For those still in queue, what we are doing right now is letting in players in batches so that we can make sure to monitor the backend and not overload it. Thanks once again for your patience and hopefully it won't be too much longer.  \n<br><br>\n<strong>Dec 06, 2024 10:07 PM (GMT)</strong> - We're aware of an issue with players in parties sometimes being placed into parties with other random players. Until we fix this, consider it a feature to enhance your social experience! \n<br><br>\n<strong>Dec 06, 2024 9:25 PM (GMT)</strong> - We've run into the same symptom again with a different problem. We are working on fixing it again but regrettably every time this happens we have to restart and wipe the databases to prevent them getting into bad or corrupted states. We'll have a fix out as soon as we can! Thank you once again and more updates will follow as we learn more.  \n<br><br>\n<strong>Dec 06, 2024 9:05 PM (GMT)</strong> - While our backend engineers and server administrators are hard at work fixing the problem we just wanted to put a message out there to thank them so much for everything they're doing. They have been tasked with a nearly impossible feat and have been up all night now into the morning. Their resilience and commitment to ensuring the realm is stable and provides the best experience for the players is nothing short of admirable. We couldn't ask for a better team! Thank you very much and please keep sending them your support!  \n<br><br>\n<strong>Dec 06, 2024 8:46 PM (GMT)</strong> - The problem we ran into was due to adding more database shards in the last minute to try to support the massive player numbers. Unfortunately there was an issue which caused multiple characters to have the same character id. Thankfully the problem has now been found and is being fixed at this very moment. Your ongoing patience and support is hugely appreciated and we will continue to provide updates as we learn more.  \n<br><br>\n<strong>Dec 06, 2024 8:41 PM (GMT)</strong> - We've run into a configuration problem and need to restart the realm. Please bear with us while we address the problem.  \n<br><br>\n<strong>Dec 06, 2024 8:13 PM (GMT)</strong> - \"Relatively imminent.\" - Jonathan  \n<br><br>\n<strong>Dec 06, 2024 7:58 PM (GMT)</strong> - Another update, we've found a last minute crash that would have affected a majority of users that we have now fixed and is being deployed, once that's out we will be doing our final checks then opening access. If there are any further updates we will let you know immediately, once again thank you very much for your patience, we're almost there!  \n<br><br>\n<strong>Dec 06, 2024 7:32 PM (GMT)</strong> - We've deployed the new database configuration and are working on getting everything back up and running. Our current time estimates should have access opening within the next half hour. Thanks again for your support, we'll continue to provide updates as they come.  \n<br><br>\n<strong>Dec 06, 2024 7:17 PM (GMT)</strong> - We're still working on deploying the database improvements and will keep you updated as soon as we know more. The moment we can provide a precise timeline we will. Thank you very much for your patience.  \n<br><br>\n<strong>Dec 06, 2024 6:15 PM (GMT)</strong> - We're doing some last minute database upgrades to try help handle the overwhelming amount of Exiles getting ready to LOGIN to Path of Exile 2. We're trying to get this done ASAP, but it may cause a short delay in the servers going live.  \n<br><br></div>\n    </div>\n</div>",
    "author": "Community_Team",
    "replies": 645,
    "lastReplyBy": "Veuron#6683",
    "lastReplyDate": "Jan 6, 2025, 8:28:30 AM",
    "type": "announcement"
  }
]