[
  {
    "id": "3687868",
    "title": "0.1.0f Hotfix 3",
    "date": "Jan 9, 2025, 10:38:13 PM",
    "url": "https://www.pathofexile.com/forum/view-thread/3687868",
    "content": "<h3>0.1.0f Hotfix 3</h3><br>\n<ul>\n<li>Fixed a bug where the Corrupted Skill Gem Level Modifier wasn't applying.</li>\n<li>Fixed a bug where inherent Weapon Skills weren't showing when linked in chat or trade windows.</li>\n<li>Fixed a client crash related to Power Siphon.</li>\n<li>Fixed a buffer underflow client crash.</li>\n</ul><br>\nThis patch has been deployed without restarting the servers, you will need to restart your client to receive the client changes in this patch.",
    "author": "Kieren_GGG",
    "replies": 167,
    "lastReplyBy": "TheRealBill#2836",
    "lastReplyDate": "Jan 13, 2025, 4:34:02 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3686954",
    "title": "0.1.0f Hotfix 2",
    "date": "Jan 9, 2025, 8:59:43 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3686954",
    "content": "<h3>0.1.0f Hotfix 2</h3><br>\n<ul>\n<li>Fixed a bug introduced in Patch 0.1.0f where players could lose Life or Energy Shield from actions such as using flasks.<br>\n</li>\n</ul><br>\nThis fix applies to new instances.",
    "author": "Kieren_GGG",
    "replies": 137,
    "lastReplyBy": "sXe_Stobie#6767",
    "lastReplyDate": "Jan 11, 2025, 5:00:05 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3686635",
    "title": "0.1.0f Hotfix 1",
    "date": "Jan 9, 2025, 4:15:43 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3686635",
    "content": "<h3>0.1.0f Hotfix</h3><br>\n<ul>\n<li>Adjusted thread priorities to reduce CPU over-utilization. This can help prevent crashes under specific circumstances.</li>\n<li>Fixed a client crash that could occur in Ultimatums.</li>\n</ul><br>\nThis patch has been deployed without restarting the servers. You will need to restart your client to receive the client changes in this patch.",
    "author": "Kieren_GGG",
    "replies": 174,
    "lastReplyBy": "sapaexs#3660",
    "lastReplyDate": "Jan 12, 2025, 10:53:49 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3686378",
    "title": "0.1.0f Patch Notes (restartless)",
    "date": "Jan 9, 2025, 12:20:30 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3686378",
    "content": "<h3>0.1.0f Patch Notes</h3><br>\n<ul>\n<li>Fixed a bug where Rare monsters could pause Delirium mist for an extended period of time, even before touching the Mirror of Delirium. This could result in opening a mirror and having no monsters spawn, or the mist not expanding fully. In addition, Delirium mist is now paused for 10 seconds when opening a Strongbox (previously 5). <em>Note that unrelated to Delirium Mist, further changes to Strongboxes will be made in an upcoming patch to make them less terrible.</em></li>\n<li>Fixed a bug where \"increased effect of small Passive Skills in Radius\" on Time-Lost Jewels was affected by increases and reductions to modifier effect, such as through The Adorned Unique Jewel.</li>\n<li>Fixed a bug where if a player changed their maximum life, energy shield or mana (such as through equipping and unequipping items) their current life, energy shield, mana, overcapped mana, or overcapped energy shield would also increase.</li>\n<li>Fixed a bug where overcapped life from Life Remnants would be erased whenever maximum life changed (such as from levelling up or weapon swapping).</li>\n<li>Fixed a bug where the projectiles of Zalmarath, the Colossus' knife attack were incorrectly positioned on top of the player.</li>\n<li>Fixed a bug where aftershocks of Rolling Slam were not dealing damage.</li>\n<li>Fixed a bug where Ritual Altars could sometimes fail to activate.</li>\n<li>Fixed a bug where Xesht, We That Are One could sometimes endlessly throw hands.</li>\n<li>Fixed a bug where the Mad Wolf of Ogham quest could be incompletable if you travelled to Act 2 by other means than talking to The Hooded One.</li>\n<li>Fixed a bug where many Precursor Tablet modifier descriptions did not display when hovering over Maps in radius of the completed Tower.</li>\n<li>Fixed a client crash that could occur after entering Demon Form while fighting Zarokh, the Temporal.</li>\n<li>Fixed a client crash that could occur with Fiery Death Support in party-play.</li>\n<li>Fixed a client crash that could occur on PlayStation 5.</li>\n</ul><br>\nThis patch has been deployed without restarting the servers. You will need to update your client to receive the client changes in this patch.",
    "author": "Kieren_GGG",
    "replies": 354,
    "lastReplyBy": "PARADOX SKISM#8996",
    "lastReplyDate": "Jan 13, 2025, 4:35:23 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3683685",
    "title": "0.1.0e Hotfix 7",
    "date": "Jan 7, 2025, 1:24:52 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3683685",
    "content": "<h3>0.1.0e Hotfix 7</h3><br>\n<ul>\n<li>Fixed a bug that could cause some characters to be disconnected, most notably when trying to use the Demon Form skill granted by the Demonic Possession Infernalist Ascendancy Passive Skill.</li>\n<li>Fixed a visual bug with item deferral cost in Ritual.</li>\n<li>Fixed a client crash.</li>\n</ul><br>\n<br>\nYou will need to restart your client to receive the client changes from this patch. The Demon Form disconnection fix applies to new instances.",
    "author": "Kieren_GGG",
    "replies": 273,
    "lastReplyBy": "onenutt#2549",
    "lastReplyDate": "Jan 12, 2025, 12:41:07 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3682380",
    "title": "0.1.0e Hotfix 6",
    "date": "Jan 6, 2025, 6:03:40 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3682380",
    "content": "<h3>0.1.0e Hotfix 6</h3><br>\n<ul>\n<li>Fixed a bug where allocating Chaos Inoculation would incorrectly count you as being on Low Life.</li>\n</ul>",
    "author": "Kieren_GGG",
    "replies": 252,
    "lastReplyBy": "Cursedfly#5363",
    "lastReplyDate": "Jan 9, 2025, 11:48:50 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3677329",
    "title": "0.1.0e Hotfix 5",
    "date": "Jan 2, 2025, 10:26:28 PM",
    "url": "https://www.pathofexile.com/forum/view-thread/3677329",
    "content": "<h3>0.1.0e Hotfix 5</h3><br>\n<ul>\n<li>You can no longer use the instance manager to create multiple instances of the Trial of the Sekhemas.</li>\n</ul>",
    "author": "Stacey_GGG",
    "replies": 431,
    "lastReplyBy": "Riverwind77#5126",
    "lastReplyDate": "Jan 7, 2025, 11:31:54 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjo1NzIsInNpemUiOiJhdmF0YXIifV0/da0980dacf/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3650268",
    "title": "0.1.0e Hotfix 4",
    "date": "Dec 19, 2024, 9:32:21 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3650268",
    "content": "<h3>0.1.0e Hotfix 4</h3><br>\n<ul>\n<li>Volcanic Fissure Aftershocks can no longer create Jagged Ground.</li>\n<li>Fixed a bug where characters who hadn't completed the campaign could enter endgame areas through other players hideouts.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 249,
    "lastReplyBy": "Valkaneer#5171",
    "lastReplyDate": "Jan 6, 2025, 4:48:05 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3647079",
    "title": "0.1.0e Hotfix 3",
    "date": "Dec 18, 2024, 8:27:44 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3647079",
    "content": "<h3>0.1.0e Hotfix 3</h3><br>\n<ul>\n<li>Fixed 4 instance crashes.</li>\n<li>Take 2, fixed a bug where certain rare monsters would respawn at checkpoints after Culling them with Lightning Warp.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 97,
    "lastReplyBy": "calm_routine_#7411",
    "lastReplyDate": "Dec 27, 2024, 8:52:37 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3646886",
    "title": "0.1.0e Hotfix 2",
    "date": "Dec 18, 2024, 6:56:41 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3646886",
    "content": "<h3>0.1.0e Hotfix 2</h3><br>\n<ul>\n<li>Fixed a bug where Shapeshift Weapon Set points weren't applying in instances after allocating them.</li>\n<li>Fixed a bug introduced in patch 0.1.0e where the Spell Gem Level from the Demon Form buff did not apply unless you resocketed affected gems.</li>\n<li>Fixed unintentionally lowering the base minion critical damage bonus from +50% to +30% in patch 0.1.0e. We have buffed base minion critical damage bonus to be +100% (higher than pre 0.1.0e values) to match the base player critical damage bonus. This will display incorrectly in the character panel until a later patch.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 33,
    "lastReplyBy": "tweak#8062",
    "lastReplyDate": "Dec 26, 2024, 8:24:37 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3646074",
    "title": "0.1.0e Hotfix 1",
    "date": "Dec 18, 2024, 2:48:25 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3646074",
    "content": "<h3>0.1.0e Hotfix 1</h3><br>\n<ul>\n<li>Fixed a bug where Unearth wasn't raising temporary minions in some cases.</li>\n<li>Fixed an instance crash with Totem skills.</li>\n<li>Fixed an instance crash with Wind Dancer.</li>\n<li>Fixed an instance crash with Lightning Warp.</li>\n<li>Fixed an instance crash in Trial of the Sekhamas.</li>\n<li>Fixed a bug where the Passive Skill Notable 'Ancient Aegis' didn't work.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 75,
    "lastReplyBy": "Samsmzo#0366",
    "lastReplyDate": "Dec 27, 2024, 5:03:19 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3645467",
    "title": "0.1.0e Patch Notes",
    "date": "Dec 17, 2024, 11:00:57 PM",
    "url": "https://www.pathofexile.com/forum/view-thread/3645467",
    "content": "<h3>0.1.0e Patch Notes</h3><br>\n<strong>General Improvements and Changes</strong><br>\n<ul>\n<li>Added the capacity to fast-travel between Checkpoints within an area. You can now select checkpoints which will bring up your Map Overlay allowing you to select other Checkpoints you have discovered in the area to travel to them immediately. Many more checkpoints have been added to areas generally at all the entrances and exits to areas, meaning if you find those first, you are able to instantly travel to them if you choose to go back and explore an area.</li>\n<li>Passive Point Respeccing has been made cheaper especially at higher levels, it had a relatively aggressive curve getting more expensive with character level, we have flattened that curve so it doesn't exponentially grow as much. For Example, this should generally result in an approximately 40-50% less Gold Cost for respeccing between the start and middle of Endgame progression.</li>\n<li>Added a shortcut to open a skills advanced information display by right-clicking the skill on your Skill Bar.</li>\n<li>You can now compare equipped Flasks when using a Gamepad.</li>\n<li>Added Chance Shards to the Currency Exchange.</li>\n<li>Added a button to travel to your Guild Hideout when interacting with the Waypoint.</li>\n</ul><br>\n<strong>Endgame and Monster Balance</strong><br>\n<ul>\n<li>Maps no longer have additional elemental resistance penalties inherently applied at Tier 6 and Tier 11 or higher Maps. It is now consistent across all of the Endgame at the same value as it was previously at Tier 1.</li>\n<li>Critical Strikes from Monsters now deal 40% less bonus Damage.</li>\n<li>Chaos Damage now scales less aggressively over the Endgame.</li>\n<li>The Ground Laser and Ground Lightning abilities used by the Runed Knight in Expedition Encounters now deal substantially less Damage.</li>\n<li>The Waystone Modifier that adds Burning Ground to your Maps no longer increases in coverage or area with higher Tier Waystones.</li>\n<li>The 'Siphons Flask Charges Modifier' on Monsters now drains ten-times less Flask Charges per second. (This was unintentional).</li>\n<li>Disabled the Volatile Crystals Modifier, to be revised in the future pending telegraphing improvements.</li>\n<li>The Trail of Fire monster Modifier now deals 30% less Damage and lasts for 3 seconds (from 5 seconds).</li>\n<li>The Trail of Lightning monster Modifier now lasts for 4 seconds (from 8 seconds).</li>\n<li>The Trail of Ice monster Modifier now lasts for 4 seconds (from 8 seconds).</li>\n<li>The Purple Explosives created by the Volatile Plants Modifier on Rare Monsters now deal significantly less Damage.</li>\n<li>Packs of Prowling Chimeral's in Maps now contain less of the Prowling Chimerals and spawn alongside some Zombies.</li>\n<li>Lowered the baseline monster density of Breach Encounters, primarily by reducing the frequency of the \"Elite\" monsters appearing.</li>\n<li>Fixed an inconsistency in the different types of packs that could spawn during Breach Encounters, you should now see more different types of Monsters appearing on an area to area basis.</li>\n<li>The volatiles spawned by the Volatile Fiends Trial of Chaos Modifier now accelerate over time.</li>\n<li>The Stormcaller Runes Trial of Chaos Modifier are now smaller, take longer to charge up when standing inside and give more time to escape once triggered. The Runes now also get larger as the Modifier is upgraded.</li>\n<li>Improved the hitboxes on a number of abilities used by Blackjaw, the Remnant.</li>\n<li>The Crossbow variants of the Decrepit Mercenary monsters that dealt Fire damage now deal less damage.</li>\n</ul><br>\n<strong>Trial of the Sekhamas Improvements</strong><br>\n<ul>\n<li>Honour Damage now scales down based on distance to enemies, you now take up to 35% less Honour Damage when in close range, tapering as you are further away from Monsters.</li>\n<li>Fixed a bug where Damage over Time was dealing three-times as much damage to Honour as intended in the Trial of the Sekhemas, and fixed a bug where Honour Resistance was only applying to two-thirds of that damage taken. (This got confusing for us too).</li>\n<li>Skitter Golems no longer use basic attacks and instead now just explode as their attacks were largely unavoidable when in Melee Range.</li>\n<li>Serpent Clan burrow and ambush attacks now have improved visual telegraphing and cannot be used from as far away.</li>\n<li>Volcanoes created by Rattlecage's Fissure Slam now last half the duration.</li>\n<li>Added keyword hover for the Honour mechanic in the Trial of the Sekhamas.</li>\n</ul><br>\n<strong>Skill Balance</strong><br>\n<ul>\n<li>Rolling Slam's Second Slam now deals 50% more Damage to Heavy Stunned Enemies</li>\n<li>Ice Shot Shards (Secondary) now gains additional Projectiles as it Levels up</li>\n<li>Ice Shot Shards now targets within 90 Degree Cone</li>\n<li>Ice Shot Shards now travel further base (200ms, from 100ms), to be tested &amp; iterated.</li>\n<li>Ice Shot Arrow &amp; Projectiles are now smaller and are the same size as other arrows.</li>\n<li>Electrocuting Arrow Base Duration to 25 seconds (from 12), Doubling Quality Bonus also.</li>\n<li>Barrage now has 25% Less damage on Barraged Attacks [From 60% Less] at Level 1, same Scaling Per Level.</li>\n<li>Barrage now has +2 Repeats base, from +1.</li>\n<li>Shockchain Arrow's Shockwaves now deal 100% more Damage.</li>\n<li>Sniper's Mark cooldown reduced from 6 seconds to 2 seconds at all Levels.</li>\n<li>Combat Frenzy now can now gain a Frenzy Charge no more than every 3 seconds (from 7 seconds) at Level 1, to approximately 1.5 seconds at Level 20.</li>\n<li>Stormcaller Arrow's Bolt now gains additional Impact Radius as it Levels.</li>\n<li>Vine Arrow's Damage over Time has been adjusted, it is now slightly higher at Lower Levels, and substantially lower at Higher Levels. The intention of this ability was that you poison it to spread poisons, as opposed to the vine itself dealing immense amounts of Damage.</li>\n<li>Tornado Shot's Damage over Time has been adjusted, it is now slightly higher at Lower Levels, and substantially lower at Higher Levels. The intention of this ability was to propagate your other Bow skills, as opposed to doing an immense amount of damage itself.</li>\n<li>Magnetic Salvo can now only use your stuck Lightning Arrows as opposed to those created by your Party Members.</li>\n<li>Increased the damage growth per level on Unearth (non-Minion component), Bonestorm, Bone Cage, Bone Blast (Wand Skill) and Power Siphon (Wand Skill). Results in approximately 50% more damage at Gem Level 25.</li>\n<li>Increased the damage growth per level on Essence Drain, Contagion, Profane Ritual and Chaos Bolt (Wand Skill). Results in approximately 33% more damage at Gem Level 25.</li>\n<li>Bone Cage base Critical Strike Chance has been increased to 15% (from 13%).</li>\n<li>Skeleton Arsonists' Spirit Costs now match Frost and Ice Mages from Level 5 onwards, making them more expensive while keeping their costs early-game the same.</li>\n<li>Bone Offering Explosions now have 15% Critical Strike Chance (from 13%).</li>\n<li>Resonating Shield, Shield Charge and Shield Wall now have 6-8 added Physical Damage per 15 Armour on your Shield at all Levels.</li>\n<li>Resonating Shield radius increased to 2.3 metres (from 1.8 metres).</li>\n<li>Shield Wall explosions increased to 4 metres (from 2 metres).</li>\n<li>Shield Wall now can create a maximum of 2 walls (from 1 wall).</li>\n<li>Siege Cascade now has an Attack Time of 75% (from 55%).</li>\n<li>Siege Cascade now searches for targets in a 3.5 metre radius (from 2.5 metres)</li>\n<li>Siege Cascade now has 50% more Damage against Immobilized Enemies (from 200%)</li>\n<li>Siege Cascade's Explosion now deals 167% more Damage (accounting for the decrease in damage against Immobilized Enemies).</li>\n<li>Siege Cascade now has 30% less Reload Speed (from 50% less).</li>\n<li>Siege Cascade's Quality is now 2% Damage against Immobilized Enemy per Quality (from 4%).</li>\n<li>Stormblast Bolts now has a maximum of 30 active Bolts (from 9).</li>\n<li>Stormblast Bolts now has 5 Bolts in the Clip (from 3).</li>\n<li>Stormblast Bolts now has 30% less Reload Speed (from 50% less).</li>\n<li>Plasma Blast now has 47% more Damage with its Initial Hit and 25% less Damage with its Explosion, causing it to rely less on colliding with walls to deal enough damage.</li>\n<li>Artillery Ballista's explosion radius increased to 1.8 metres (from 1.4 metres).</li>\n<li>Artillery Ballista's Damage increased by approximately 21%.</li>\n<li>Gathering Storm's Perfect Dash now deals 53% more Damage.</li>\n<li>Wave of Frost now has 275% more Freeze Buildup at all Levels (from 150% scaling up over levels).</li>\n<li>Staggering Palm's duration now scales with levels. It has 6 second duration at Level 1, scaling up by 0.2 seconds per Level (from 6 seconds at all Levels).</li>\n<li>Staggering Palm's Projectiles now deal 20% more Damage at all Levels.</li>\n<li>Concoction skills from the Pathfinder Ascendancy Class now consume 3 charges from Mana Flasks (from 5). Their damage has been increased and deal approximately 66% more Damage when the skill is Level 20. In addition the base added damage has been increased by at least 50% for all Concoction skills, with Poisonous and Bleeding Concoction receiving greater damage buffs. Fulminating Concoction now has a Critical Strike Chance of 8% (from 6%), Shattering Concoction now has a Critical Strike Chance of 11% (from 7%), Explosive Concoction now has 100% more chance to Ignite Enemies and 100% more magnitude of Ignites inflicted, Fulminating Concoction now has 100% more chance to inflict Shock and Shattering Concoction now has 100% more Freeze Buildup.</li>\n<li>The Hunter's Talisman passive skill Notable now grants +1 Charm Slot. The small passive skills leading up to it now grant the stat it formerly gave. The Charm helper text has been updated to indicate that you cannot have more than three Charm Slots unlocked, so that we can add more sources of it in the future.</li>\n<li>Added a new Lightning Damage and Electrocute Cluster to the passive tree in between the Ranger and Monk sections.</li>\n<li>The Heavy Frost Notable Passive Skill now causes Hits to only ignore Enemy Resistances of Frozen Enemies if their resistance values were positive.</li>\n<li>Supercharged Slam now builds up stages slower but gains 40% more Damage per Stage now (from 20%). This may display as 20% still incorrectly until a later patch.</li>\n<li>Electrocute is now 25% harder to Buildup. (But the Damage Penalty has been removed from the Support Gem)</li>\n<li>It is now more difficult to chain-freeze enemies, by reducing the amount of Freeze Buildup applied after a Freeze has been applied.</li>\n<li>Added a marker effect to Ember Fusillade's preferred target.</li>\n</ul><br>\n<strong>Support Balance</strong><br>\n<ul>\n<li>Added the Tremors Support Gem. Which can be used to give up to multiple more Aftershocks to Skills, with a damage penalty.</li>\n<li>Added the Bidding Support Gem. Which can be used to give more damage to the Command Skills of Supported Minions.</li>\n<li>The Fire Exposure, Lightning Exposure and Cold Exposure Support Gems no longer penalize Damage of Supported Skills. They now have a Mana Cost Multiplier of 120%.</li>\n<li>The Electrocute Support no longer penalizes Damage. Instead it now prevents the Supported Skill from being able to Shock.</li>\n<li>The Lacerate Support now grants 50% chance to Bleed (from 30%).</li>\n<li>The Envenom Support now grants 50% chance to Poison (from 60%).</li>\n<li>The Impact Shockwave Support now has an aftershock radius of 2 metres (from 1.4 metres).</li>\n<li>The Bidding Support now grants 30% more Damage to Minion Command Skills (from 20%).</li>\n<li>The Considered Casting Support now only supports Spells you cast yourself. It also now grants 40% more Spell Damage (from 25%) and 15% less Cast Speed (from 10%).</li>\n<li>The Aftershock Support now has 25% chance to cause an Aftershock (from 20%).</li>\n<li>The Mobility Support no longer has a Damage Penalty, but applies 30% less Movement Speed Penalty (from 40%).</li>\n<li>The Execrate Support now has 100% chance to inflict Ailments (from 50%).</li>\n<li>The Ricochet Support now has 40% chance to Chain from Terrain (from 20%).</li>\n<li>The Withering Touch Support now has 25% less Damage (from 50%).</li>\n<li>The Ferocity Support now has 40% more Skill Speed when consuming a Frenzy Charge (from 30%).</li>\n<li>Changed the Wildshards Support Gem to fire projectiles in a Circle instead of a Spiral pattern.</li>\n<li>The Decaying Hex Support now deals 60% of Intelligence as Chaos Damage per Second (from 30%).</li>\n<li>The Stomping Ground Support's Shockwave now deals 80% to 120% of your Strength as Physical Damage (from 20 to 30%).</li>\n</ul><br>\n<strong>Item Balance</strong><br>\n<ul>\n<li>The Charm Modifiers on Belts have been made substantially more common and now appear at much lower levels. The 'of Symbolism' Modifier now appears from level 23 onwards, and the 'of Inscription' Modifier now appears from level 64 onwards.</li>\n<li>The unique item The Adorned now applies to Time-Lost Jewels.</li>\n<li>The Time-Lost Jewel Modifier 'of Regeneration' now applies 3-7% increased Life Regeneration Rate to Notables in Radius, from 1-2%. Existing versions of this item will not be updated unless a Divine Orb is used.</li>\n</ul><br>\n<strong>Bug Fixes</strong><br>\n<ul>\n<li>Fixed a bug where the Unique Item Maligaro's Virtuosity was granting the wrong amount of Critical Damage.</li>\n<li>Fixed a bug where the Crumbling Walls Atlas Passive Notable was applying to Maps that didn't contain Breaches.</li>\n<li>Fixed a bug where the stat granted by the Organized Forces Atlas Passive Notable was causing less Waystones to drop due to trying to upgrade them to a Tier that didn't exist.</li>\n<li>Fixed a bug where interactables would remove the player from Demon Form. </li>\n<li>Fixed a bug where certain rare monsters would respawn at checkpoints after consuming their corpse.</li>\n<li>Fixed a bug where leveling a skill gem incorrectly displayed the level change when it was supported by gems which granted additional skill levels. This was purely a visual issue.</li>\n<li>Fixed a bug where Unearth didn't work with the Sacrifice Spirit Gem.</li>\n<li>Fixed a bug where the Elemental Expression skill from the Invoker Ascendancy Class had an incorrect hitbox.</li>\n<li>Fixed a bug where the Monk Ascendancy node 'Embrace the Darkness' would desync when losing Life and Energy Shield. </li>\n<li>Fixed a bug which prevented party members from entering the Xesht fight once it had begun.</li>\n<li>Fixed a bug where the Cosmetics Equipment UI was missing the tier selector for some slots.</li>\n<li>Fixed a bug where the Trialmaster encounter dialogue failed to play.</li>\n<li>Fixed a bug with the Rising Tempest Support where it was giving More Damage per Elemental Skill used rather than More Damage per Elemental Type that was used.</li>\n<li>Fixed a bug where pathfinding could cause jittering of the character in some cases. </li>\n<li>Fixed a bug where destroying items in hideouts wasn't possible.</li>\n<li>Fixed a bug where Frost Wall segments could leave phantom walls, causing invisible blocking. </li>\n<li>Fixed a bug where implicit abilities on non-weapon unique items required a low level to use.</li>\n<li>Fixed a bug where the Chronomancers 'Debuff Expiry Rate' nodes were applying to Quicksand Hourglass, extending its cooldown.</li>\n<li>Fixed a bug where Ember Fusillade could fail to target enemies.</li>\n<li>Fixed a bug where the Sacrifice Spirit Gem couldn't target minions with Profane Ritual.</li>\n<li>Fixed a bug where the Explosion from the Armour Explosion Support could explode inanimate objects.</li>\n<li>Fixed a bug where some Spirit Gems displayed an incorrect error message.</li>\n<li>Fixed a bug where the Arbiter of Ash area level wasn't being increased with difficulty.</li>\n<li>Fixed a bug where Emergency Reload wasn't put on cooldown if you were using two Emergency Reload Skill Gems.</li>\n<li>Fixed a bug where the Energizing Bolt Flask effect didn't work.</li>\n<li>Fixed a crash on Gamepad where Concoction skills from the Pathfinder Ascendancy Class would cause a crash when changing areas.</li>\n<li>Fixed a bug where some players would disconnect when trying to enter maps in the Ziggurat Refuge, or guild hideouts while in a party.</li>\n<li>Fixed a bug where the Explosion from the Armour Explosion Support could trigger itself recursively.</li>\n<li>Fixed a bug where Ice Shot was unable to cause Freeze buildup.</li>\n<li>Fixed a bug where some volatiles in the Trial of Chaos would follow the player up elevators.</li>\n<li>Fixed a bug where Inscribed Ultimatums and Djinn Baryas dropped in Cruel would incorrectly tell you that you could get Ascendancy Points by completing them, even if you wouldn't.</li>\n<li>Fixed a bug where Ballista skills didn't work with Tornadoes created by Tornado Shot.</li>\n<li>Fixed a bug when using a Gamepad where the Hide Sockets option did not work.</li>\n<li>Fixed a bug when using a Gamepad where you couldn't see Distilled Emotion recipes on the passive tree.</li>\n<li>Fixed a bug when using a Gamepad where you couldn't access the Portal Access settings while viewing the hideout stash.</li>\n<li>Fixed a bug where creating Solo Self-Found characters wasn't possible when using a Gamepad while Migrations are disabled.</li>\n<li>Fixed a bug when using a Gamepad where you couldn't use the shortcut bind to open chat.</li>\n<li>Fixed a bug when using a Gamepad that caused it to take multiple attempts to change the tier selector of Microtransactions.</li>\n<li>Fixed a bug when using a Gamepad where you couldn't set an individual price on an item in premium stash tabs.</li>\n<li>Fixed a bug when using a Gamepad where you couldn't socket jewels into specific unique items.</li>\n<li>Fixed 12 Client Crashes.</li>\n<li>Fixed 3 Instance Crashes.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 733,
    "lastReplyBy": "Thiago_Bones#9530",
    "lastReplyDate": "Jan 2, 2025, 8:04:18 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3634784",
    "title": "0.1.0d Hotfix 5",
    "date": "Dec 14, 2024, 10:55:46 PM",
    "url": "https://www.pathofexile.com/forum/view-thread/3634784",
    "content": "<h3>0.1.0d Hotfix 5</h3><br>\n<ul>\n<li>Fixed a bug where The Trail of Corruption quest in Act 2 could fail to progress when clearing the Sandstorm if you disconnected during it's animation. Those who were progression blocked by this should be able to use the marker to trigger this event again.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 151,
    "lastReplyBy": "slayersichi#0486",
    "lastReplyDate": "Dec 18, 2024, 1:29:02 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3631452",
    "title": "0.1.0d Hotfix 4",
    "date": "Dec 14, 2024, 3:17:28 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3631452",
    "content": "<h3>0.1.0d Hotfix 4</h3><br>\n<ul>\n<li>Fixed a bug where the Arbiter Atlas Tree notable stats weren't correctly applying to the area.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 83,
    "lastReplyBy": "eclap78#2642",
    "lastReplyDate": "Dec 19, 2024, 12:13:07 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3631349",
    "title": "0.1.0d Hotfix 3",
    "date": "Dec 14, 2024, 2:34:06 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3631349",
    "content": "<h3>0.1.0d Hotfix 3</h3><br>\n<ul>\n<li>Fixed two instance crashes.</li>\n<li>Fixed a bug where Summon Raging Spirits failed to cleanup on death when they were killed on the same frame they were created.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 30,
    "lastReplyBy": "roachmanley#2097",
    "lastReplyDate": "Dec 16, 2024, 6:32:46 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3627221",
    "title": "0.1.0d Hotfix 2",
    "date": "Dec 13, 2024, 4:12:33 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3627221",
    "content": "<h3>0.1.0d Hotfix 2</h3><br>\n<ul>\n<li>Fixed a bug which prevented the elevator at end of The Trial of Chaos from working to access the Trialmaster Boss.</li>\n<li>Fixed a bug which could prevent the Portal from appearing on Floor 4 of Trial of the Sekhamas.</li>\n</ul><br>\n<br>\nThis patch has been deployed without restarting the servers. You will need to restart your client to receive the client changes in this patch.",
    "author": "Jeff_GGG",
    "replies": 290,
    "lastReplyBy": "Jakestation#5003",
    "lastReplyDate": "Dec 16, 2024, 10:24:49 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3621780",
    "title": "0.1.0d Hotfix 1",
    "date": "Dec 12, 2024, 4:37:28 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3621780",
    "content": "<h3>0.1.0d Hotfix 1</h3><br>\n<ul>\n<li>We missed one! Cast on Critical Strike now also cares about the Damage of the hit when determining how much energy to gain to prevent the use of high-crit low level skills, this should mean using lower hit frequency skills that hit harder are also now much stronger for this.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 757,
    "lastReplyBy": "Espirituo#3071",
    "lastReplyDate": "Dec 16, 2024, 9:06:28 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3621299",
    "title": "0.1.0d Patch Notes",
    "date": "Dec 12, 2024, 1:47:51 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3621299",
    "content": "<h3>0.1.0d Patch Notes</h3><br>\n<strong>General Improvements and Changes</strong><br>\n<br>\n<ul>\n<li>Passive Block chance now applies to blockable hits from all directions, as opposed to just hits from in front.</li>\n<li>Player size is now set to Zero units while dodge rolling instead of One unit.</li>\n<li>Some smaller monsters can now be pushed while dodge rolling. This includes monsters such as the Adorned Beetles in Keth.</li>\n<li>Inscribed Ultimatums and Djinn Baryas now display whether you will obtain Ascendancy Skill Points upon completing the Trial of Chaos or Trial of the Sekhemas respectively.</li>\n<li>Removed World Map Pins for encounters that were not from specific locations in Areas. ie. From Monster drops.</li>\n<li>Improved attack in place behaviour.</li>\n<li>Rain of Arrows and Firestorm now have a hit-rate limit to prevent cases of them absolutely obliterating very large bosses. This will have little to no impact outside of boss fights with very large hitboxes.</li>\n<li>Leech has been buffed.</li>\n<li>Boneshatter now more reliably hits your target.</li>\n<li>The duration of Armour Break has been increased to 12 seconds (previously 6).</li>\n<li>To improve performance, Incinerate now creates circular areas of ignited ground instead of segments.</li>\n<li>Added CTRL+Click shortcut to open the Currency Exchange at the appropriate NPCs.</li>\n<li>Added a button to travel to the Trial of Chaos on the world map.</li>\n<li>Added art for Close Combat Support.</li>\n<li>Added 2D art for the Defiance of Destiny Unique Amulet.</li>\n<li>Added \"Ascendancy Skill Points\" as a keyword, which details how sets of Ascendancy Points are obtained.</li>\n<li>Added search functionality for Gemcutting and vendor inventories when using a controller. Keybinds for searching Stash on a controller have also been updated.</li>\n<li>Added Gemcutting restrictions option for Gamepad.</li>\n<li>Added suggested Supports for Time of Need.</li>\n<li>Updated the suggested Supports for Bonestorm.</li>\n<li>Added an option for opening the Trade website to the main menu for consoles.</li>\n<li>Runes now sell to vendors for more Gold.</li>\n<li>Updated art for Reserved Life and Mana.</li>\n<li>Updated the description on Runes to clarify that once socketed they cannot be replaced.</li>\n<li>Auras and Curses that affect ally or enemy resistances now display values in the Skill popout panel.</li>\n<li>Tweaked the audio of the Kiwi Pets, Chimera Pet, and Baby Crowbell Pet to reduce their impact in town areas.</li>\n<li>Updated the wording on the Invoker's \"...and Protect me from Harm\" Ascendancy Passive Skill to clarify its functionality.</li>\n<li>Updated the description on Hexblast to clarify that it only detonates a single Curse per Enemy in its radius.</li>\n<li>Updated the description on Fiery Death Support to clarify that the Supported Skill does not need to kill the ignited enemy itself.</li>\n<li>Reduced the defenses provided to monsters by the Magma Barrier modifier.</li>\n<li>Walking Goliaths no longer use their suicide attack if they are Rare.</li>\n</ul><br>\n<strong>Trigger Gems and Energy Gain</strong><br>\n<br>\n<ul>\n<li>Trigger gem energy gain was not in the right place and it was far too easy to use ailments to trigger spells. One problem with the previous system is that if we balanced it to make triggering happen in boss fights then the triggering would happen far too often during clearing. In order to address this we are now making \"Monster Power\" part of the calculation for energy gain. This means that it's far easier to trigger skills from Unique Monsters than it is from normal monsters, but you also hit many more normal monsters when fighting. Another issue was using low level skills with unconditional ailment applications such as Flame Wall to ignite enemies for triggering. In order to make the source of the ignite matter we are making the energy gain be dependent on the strength of the ignite. We have also rebalanced all energy gain across the board.</li>\n</ul><br>\n<strong>Ultimatum Changes</strong><br>\n<br>\n<ul>\n<li>Generally improved balance across the board with Ultimatum monsters, bosses and modifiers. Mostly targeting outliers that were too difficult and bringing them in line.</li>\n<li>The monster density of Ultimatum encounters has been made more consistent.</li>\n<li>Stormcaller Runes, Blood Globules, Heart Tethers and Impending Doom rings no longer spawn while a player is on a lift or near the altars in the Vaal Soul Core room.</li>\n<li>Fixed a bug where Player Minions could get stuck at the top of the lift in the Trials of Chaos.</li>\n</ul><br>\n<strong>Bug Fixes</strong><br>\n<br>\n<ul>\n<li>Fixed a bug which caused enemies to be Primed for Stun or Electrocute earlier than intended while in a party.</li>\n<li>Fixed a bug where Gemling Legionnaires with the Integrated Efficiency Ascendancy Passive Skill allocated could lose their 3 additional Skill Slots if they were empty when entering a new area.</li>\n<li>Fixed a bug with party member reviving when using WASD input where you could revive party members from too far away.</li>\n<li>Fixed a bug where \"Waystones found have a chance to be a tier higher\" on the Atlas Passive Tree wasn't working.</li>\n<li>Fixed a bug where the Audio Mix setting was not being remembered when restarting the game.</li>\n<li>Fixed a bug where one of the small Passive Skills in the Fleshcrafter cluster was not connected to the Notable Passive Skill. It is possible for your Passive Skill Tree to be reset if you had this cluster allocated, apologies!</li>\n<li>Fixed a bug where you could not open a portal in The Riverbank in Cruel difficulty.</li>\n<li>Fixed a bug where some of Zalmarath, the Colossus' skills could persist after their death.</li>\n<li>Fixed a bug where opening a full-screen panel while disenchanting could prevent you from performing any actions until you relogged.</li>\n<li>Fixed a bug where some fire spells, such as Volatile Dead and Incinerate, were not functioning correctly with Raging Spirits.</li>\n<li>Fixed a bug where \"Buffs on you expire Slower\" from the Prolonged Assault Notable Passive Skill and other Chronomancer Ascendancy Passive Skills was applying to Debuffs and other effects as well as Buffs.</li>\n<li>Fixed a bug where non-reviving Minions were spawning a Remnant from the Grim Feast Buff when dying in your presence.</li>\n<li>Fixed a bug Infernalists with the Pyromantic Pact Ascendancy Passive Skill allocated were considered to be on Low Infernal Flame if they were at 50% of Maximum Infernal Flame or lower, instead of 35%.</li>\n<li>Fixed a bug where the world map icon for Candlemass in Cruel was not updating correctly.</li>\n<li>Fixed a bug where you could be unable to upgrade Gems despite satisfying the Attribute Requirement by having the Adaptive Capability Gemling Legionnaire Ascendancy Passive Skill allocated.</li>\n<li>Fixed a bug where Fiery Death Support was not dealing damage correctly.</li>\n<li>Fixed Infusion Support Gems on Herald skills applying the gain damage as extra elemental damage to all attacks instead of just the damage from the Herald skill.</li>\n<li>Fixed a bug where Expedition encounters could fail to generate in the Decay Map.</li>\n<li>Fixed a bug where Quality on the Sacrifice Skill was causing Minions to Revive 0-5% more slowly, instead of more quickly.</li>\n<li>Fixed a bug where the exit portal for the final boss in Trial of the Sekhemas did not visually display upon killing the boss.</li>\n<li>Fixed a bug where socketed Skills you didn't meet the requirements for were missing their name in the Skills menu when using a controller.</li>\n<li>Fixed a bug where the Elemental Storm skill granted by the Stormweaver's Tempest Caller Ascendancy Passive Skill could sometimes place the storm underneath you.</li>\n<li>Fixed a snapshotting bug with the \"Loads an Additional Bolt\" Crossbow modifier.</li>\n<li>Fixed a bug where the Contagion Skill was not spreading Poison.</li>\n<li>Fixed a bug where Tempest Bell could become invisible.</li>\n<li>Fixed a bug where NPCs were missing their name labels in Hideouts when using a controller.</li>\n<li>Fixed a bug where signing into a guest account on PlayStation 5 could delete your friends list in-game.</li>\n<li>Fixed a bug where you could sometimes be unable to enter your hideout on PlayStation 5.</li>\n<li>Fixed eight instance crashes.</li>\n<li>Fixed six client crashes.</li>\n<li>Fixed a client crash that could occur on Xbox.</li>\n<li>Fixed three client crashes that could occur on PlayStation 5.</li>\n</ul>",
    "author": "Kieren_GGG",
    "replies": 1912,
    "lastReplyBy": "Hankier#4549",
    "lastReplyDate": "Jan 11, 2025, 11:01:03 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3617298",
    "title": "0.1.0c Hotfix 2",
    "date": "Dec 11, 2024, 6:24:59 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3617298",
    "content": "<h3>0.1.0c Hotfix 2</h3><br>\n<ul>\n<li>Demon form now has a minimum of 1 life lost per second, per stack.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 117,
    "lastReplyBy": "ImaPoosay#5992",
    "lastReplyDate": "Dec 18, 2024, 2:20:16 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3612268",
    "title": "0.1.0c Hotfix 1",
    "date": "Dec 10, 2024, 8:56:01 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3612268",
    "content": "<h3>0.1.0c Hotfix 1</h3><br>\n<ul>\n<li>Summon Raging Spirits now only summons 5 Raging Spirits per cast at all levels. The tooltip display will be updated in a future restart patch.</li>\n<li>Summon Raging Spirits can no longer be spawned from triggered Fire Skills. </li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 290,
    "lastReplyBy": "ponebolezney#5412",
    "lastReplyDate": "Dec 12, 2024, 10:21:24 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3611708",
    "title": "0.1.0c Patch Notes (restartless)",
    "date": "Dec 10, 2024, 5:36:19 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3611708",
    "content": "<h3>0.1.0c Patch Notes</h3><br>\n<ul>\n<li>Campaign bosses killed after the first kill will now drop less currency items, replacing them with other items.</li>\n<li>Increased the drop rate of Regal Orbs.</li>\n<li>Significantly increased the drop rate of Gemcutter's Prisms.</li>\n<li>A single Gemcutter's Prism also improves the Quality of a Skill Gem by +5% (previously +1%).</li>\n<li>Lowered the drop rate of Chaos Orbs and distributed it amongst the other more valued Currency Items (Like Regal Orbs, Exalted Orbs).</li>\n<li>Lowered the drop rate of Artificer's Orbs and distributed it to Lesser Jeweller's Orbs.</li>\n<li>Disenchanting Rare Items with 6 Modifiers now provides 2 Regal Shards (previously 1). The value displayed will still show as 1 until a later patch.</li>\n<li>Increased the values of all Prefix Modifiers that can roll on Waystones. We've also adjusted the chances of getting the more commonly powerful Modifiers such as increases to Rarity and Pack Size.</li>\n<li>Monster Modifiers now grant higher amounts of Item Rarity and Item Quantity. This is most common on Magic and Rare enemies, but also affects Unique Enemies if applied through various Endgame Mechanics like the Deadly Evolution Keystone.</li>\n<li>Increased the chance for Rare Monsters in Maps to have 3 or 4 modifiers.</li>\n<li>Rare Monsters in Map areas are now revealed on the minimap when there are 200 Monsters remaining (previously 50).</li>\n<li>Fixed a bug where some Persistent Buff Skills, such as Raging Spirits and Mana Remnants, were not working for the Infernalist when in Demon Form.</li>\n<li>Fixed a bug where you could sometimes be unable to interact with the Map Device in The Ziggurat Refuge.</li>\n<li>Fixed a bug where Monsters Shattered in a Blood Circle Ultimatum Encounter were not contributing blood.</li>\n<li>Fixed a bug that could cause the instance to permanently stop time (freeze) when trying to revive a Chronomancer.</li>\n<li>Fixed a bug where Rare Monsters could not be found within the Chimeral Wetlands.</li>\n<li>Fixed a bug where \"Move only\" was name-locking.</li>\n<li>Fixed three instance crashes.</li>\n<li>Fixed a client crash.</li>\n</ul><br>\nThis patch has been deployed without restarting the servers. You will need to restart your client to receive the client changes in this patch. <br>\n<br>\nConsoles also have almost all the changes here (except namelocking and a client crash fix) but will still show as 0.1.0b until we next update the client.",
    "author": "Kieren_GGG",
    "replies": 274,
    "lastReplyBy": "exile13#6211",
    "lastReplyDate": "Dec 17, 2024, 1:16:00 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3606561",
    "title": "0.1.0b Patch Notes (restartless)",
    "date": "Dec 9, 2024, 6:11:38 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3606561",
    "content": "<h3>0.1.0b Patch Notes</h3><br>\n<ul>\n<li>Gas Grenade's explosion base damage has been reduced to 150%-468% at gem level 1-20 (previously 240%-749%).</li>\n<li>Gas Arrow's explosion base damage has been reduced to 100%-312% at gem levels 1-20 (previously 250%-780%).</li>\n<li>Temporarily disabled the Bloodsoaked Character Effect microtransaction.</li>\n<li>Fixed an issue where some players could get stuck on a loading screen indefinitely.</li>\n<li>Fixed a bug where you could not refund Atlas Passive Skills when using a controller.</li>\n<li>Fixed a bug with automatic gateway selection when playing on console.</li>\n<li>Fixed a client crash that could occur when toggling the \"Hide Login Email\" option.</li>\n<li>Fixed four other client crashes.</li>\n<li>Fixed two instance crashes.</li>\n</ul><br>\nThis patch has been deployed without restarting the servers, you will need to restart your client to get the client changes. Console players should have an update available with the client changes after this patch has passed their respective certification processes.",
    "author": "Kieren_GGG",
    "replies": 342,
    "lastReplyBy": "MamanBrigitte#4184",
    "lastReplyDate": "Dec 20, 2024, 8:19:13 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3601143",
    "title": "0.1.0 Hotfix 8",
    "date": "Dec 8, 2024, 7:54:48 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3601143",
    "content": "<h3>0.1.0 Hotfix 8</h3><br>\n<ul>\n<li>Fixed a client crash that could occur when using the DirectX12 renderer.</li>\n<li>Reduced the damage of Magnetic Salvos explosions by approximately by 40%.</li>\n</ul><br>\nThis patch has been deployed without restarting the servers. You will need to restart your client to receive the client changes in this patch.",
    "author": "Jeff_GGG",
    "replies": 59,
    "lastReplyBy": "NufPoD#2344",
    "lastReplyDate": "Dec 10, 2024, 7:15:37 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3600564",
    "title": "0.1.0 Hotfix 7",
    "date": "Dec 8, 2024, 4:37:36 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3600564",
    "content": "<h3>0.1.0 Hotfix 7</h3><br>\n<ul>\n<li>Temporarily disabled the \"Shielding Monsters\" modifier in Temple of the Chaos Gods.</li>\n<li>Reduced the amount of energy shield monsters gain from the Rare Modifier \"Extra Energy Shield\"</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 17,
    "lastReplyBy": "Duallight#5819",
    "lastReplyDate": "Dec 9, 2024, 6:02:14 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3599322",
    "title": "0.1.0 Hotfix 6",
    "date": "Dec 7, 2024, 11:00:53 PM",
    "url": "https://www.pathofexile.com/forum/view-thread/3599322",
    "content": "<h3>0.1.0 Hotfix 6</h3><br>\n<ul>\n<li>Reduced the Damage of Supercharged Slam by approximately 60% overall (at maximum stages). This skill was unfortunately dealing far too much damage than intended given the short channel window required to hit maximum stages. The damage display text of this skill will be incorrect until we later do a client patch.</li>\n<li>Reduced the damage of the Lightning Cascade in the Bahlak, the Sky Seer Ultimatum boss fight. </li>\n<li>Reduced the damage of Ball Lightning Explosions in the Uxmal, the Beastlord Ultimatum boss fight.</li>\n<li>Reduced the number of Lightning Runes created from the Stormcaller Runes Ultimatum Modifier, and fixed a bug where they could trigger without players standing on them.</li>\n<li>Fixed a bug with Invoker's \"...and Protect me from Harm\" Ascendancy Passive Skill, where Evasion Rating also granting Physical Damage Reduction was applying to all Damage Types.</li>\n</ul>",
    "author": "Kieren_GGG",
    "replies": 31,
    "lastReplyBy": "SketchyG#7109",
    "lastReplyDate": "Dec 12, 2024, 1:57:45 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3597430",
    "title": "0.1.0 Hotfix 5",
    "date": "Dec 7, 2024, 3:32:50 PM",
    "url": "https://www.pathofexile.com/forum/view-thread/3597430",
    "content": "<h3>0.1.0 Hotfix 5</h3><br>\n<ul>\n<li>Fixed multiple instance crashes.</li>\n<li>Fixed two client crashes.</li>\n<li>Fixed a pack purchasing problem that could occur on steam.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 21,
    "lastReplyBy": "kaszatricek#2731",
    "lastReplyDate": "Dec 8, 2024, 10:36:35 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3596774",
    "title": "0.1.0 Hotfix 4",
    "date": "Dec 7, 2024, 1:01:01 PM",
    "url": "https://www.pathofexile.com/forum/view-thread/3596774",
    "content": "<h3>0.1.0 Hotfix 4</h3><br>\n<ul>\n<li>Fixed an instance crash with Shield Wall.</li>\n<li>Fixed an instance crash with Skeletal Aronsists.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 10,
    "lastReplyBy": "StratosPOE#5078",
    "lastReplyDate": "Dec 7, 2024, 10:47:28 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3595823",
    "title": "0.1.0 Hotfix 3",
    "date": "Dec 7, 2024, 8:17:11 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3595823",
    "content": "<h3>0.1.0 Hotfix 3</h3><br>\n<ul>\n<li>Fixed a bug where trying to progress to Act 2 by talking to The Hooded One in your Hideout instead of the Clearfell Encampment could prevent you from progressing to Act 2.</li>\n<li>Fixed a bug where the Gambler's stock was not correct.</li>\n</ul>",
    "author": "Stacey_GGG",
    "replies": 4,
    "lastReplyBy": "mff1110#0930",
    "lastReplyDate": "Dec 12, 2024, 4:11:43 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjo1NzIsInNpemUiOiJhdmF0YXIifV0/da0980dacf/Path_of_Exile_Gallery_Image.jpg"
  }
]