[
  {
    "id": "3717308",
    "title": "0.1.1c Patch Notes",
    "date": "Feb 4, 2025, 10:00:23 PM",
    "url": "https://www.pathofexile.com/forum/view-thread/3717308",
    "content": "<h3>0.1.1c Patch Notes</h3><br>\nThis patch adds respawn support for more endgame content and support for renaming characters through the website, as well as other improvements and bug fixes.<br>\n<br>\n<strong>Improvements and Changes</strong><br>\n<br>\n<ul>\n<li>Added up to five respawn attempts for the Twisted Domain area, based on the area difficulty. If the Breach Domain is completed but you die during the Xesht, We Who Are One boss fight, you will revive at the entrance to the boss arena. If you die before completing the Breach Domain, you will revive at the start of the domain. Repeated attempts of the domain will result in no experience from monsters.</li>\n<li>Added up to five respawn attempts for the Olroth, Origin of the Fall boss fight, based on the fight difficulty.</li>\n<li>Added up to five respawn attempts for the Crux of Nothingness area, based on the area difficulty. If you die before killing The King of the Mists, reviving will place you inside the boss arena and begin the fight again.</li>\n<li>Respawns can only be triggered by the person who put in the Expedition Logbook, Breachstone or An Audience with the King, and everyone in your party will be respawned at the same time.</li>\n<li>Added more checkpoints to several Map areas and improved the placement of some checkpoints.</li>\n<li>Added the \"/ResetAtlas\" chat command which can only be used to reset your Atlas when it's in a bricked state (no available maps).</li>\n<li>Added Minimap Icons for Strongboxes.</li>\n<li>Minimap Icons for League mechanics now remain visible regardless of how far away you travel from them, making it easier to return to them later.</li>\n<li>Hitting inanimate objects, such as Ice Crystals, Tempest Bell or Vine Arrow plants, can no longer cause your trigger skills to generate energy.</li>\n<li>Vine Arrow plants no longer take damage from hits, and therefore no longer cause your on-hit effects and similar stats to take effect.</li>\n<li>Minions can now briefly squeeze through smaller gaps if they've failed to move for a short period.</li>\n<li>Channelled skills which scale their costs with attack/cast speed modifiers now explicitly describe this.</li>\n<li>Unused stats in the skill and character menu interfaces are no longer displayed.</li>\n<li>The Stun Threshold tooltip now provides more information on stun mechanics.</li>\n<li>Added customisable targeting behaviour settings when using a controller. These can be viewed and selected in the bind skills menu.</li>\n<li>Added Charms to the controller HUD.</li>\n<li>Added a setting to display advanced item information when inspecting items while using a controller.</li>\n<li>Added dedicated keybinds for confirming choices in various interfaces when using a controller, such as opening a Map in the Map Device, or starting a Trial at the Relic Altar.</li>\n<li>Increased font size of text in various locations when using a controller.</li>\n<li>Improved item navigation when using a controller.</li>\n<li>Improved targeting behaviour for ranged attacks when using a controller.</li>\n<li>Improved targeting behaviour for Offering skills when using a controller.</li>\n<li>Made further changes to reduce the aggressive targeting of Tempest Bell when using a controller.</li>\n<li>Reverted the change from the 0.1.1 patch that allowed you to pick up items and interact with some objects while performing other actions due to issues it introduced.</li>\n<li>You can now change the name of your Path of Exile 2 characters, or swap the names of two of your characters. You can access this through the <a href=\"https://www.pathofexile.com/my-account\">My Account</a> page on the website after the patch is deployed.</li>\n<li>Enabled the following existing cosmetic microtransactions for use in Path of Exile 2: Exile's Pilfering Ring, Exile's Pedometer Ring, Evertree Map Devices, Timekeeper's Map Devices, Peddler's Rain Hideout Decorations, Octoparasite Pets.</li>\n<li>Continued to incrementally improve the sound, art, effects and environments.</li>\n</ul><br>\n<strong>Bug Fixes</strong><br>\n<br>\n<ul>\n<li>Fixed a bug where you could lose access to the Map Device when migrating out of a Solo Self-found League.</li>\n<li>Fixed a bug where Zarokh, the Temporal could continue using his spinning lightning skill after death or while heavily stunned.</li>\n<li>Fixed a bug where Zarokh, the Temporal's spinning lightning beam skill was not able to hit victims hiding in the corners of the arena.</li>\n<li>Fixed a bug where players could remain immune to damage after the expiry of a stolen Proximal Tangibility monster modifier.</li>\n<li>Fixed a bug where on-death elemental explosions from Rare Monster minions would fail to render their telegraph if the corpse was destroyed on hit, such as by shattering the monster.</li>\n<li>Fixed a bug where the Twin Threats Atlas Passive Skill could sometimes duplicate monsters incorrectly, resulting in monsters that could not be damaged.</li>\n<li>Fixed a bug that would prevent kills with Damage over Time being assigned correctly to players, most notably any death to poison or bleeding while the monster still had Energy Shield at the time of death.</li>\n<li>Fixed a bug where it was possible to snapshot increases to the level of Elemental Skills using the Collapsing Horizon Unique Quaterstaff.</li>\n<li>Fixed a bug where parts of the Atlas could fail to render if they were far away from your most recent map.</li>\n<li>Fixed a bug where attempting to equip a weapon with a full inventory when using a controller could lose the previously equipped weapon.</li>\n<li>Fixed some wonky checkpoints in the Steaming Springs and Blooming Fields Map areas.</li>\n<li>Fixed a bug where The Trialmaster could use his time stop skill and vanish during his fight.</li>\n<li>Fixed a rare bug where certain quest items were not dropping for some players correctly.</li>\n<li>Fixed a bug where the Chimeral Inscribed Ultimatum quest item dropped by Xyclucian, the Chimera could disappear if you tried to pick it up while your inventory was full.</li>\n<li>Fixed a bug where Persistent Buffs would be removed upon reaching the maximum overflowed Life with the Couture of Crimson Unique Body Armour equipped.</li>\n<li>Fixed a bug which caused Direct Minions to cause summoned Ancestral Totems to stop using their skills until resummoned.</li>\n<li>Fixed a bug where Black Strider's web mortar impacts could not be blocked or avoided by dodge roll.</li>\n<li>Fixed a bug where Withering Presence's frequency and duration values would display as double their actual values in the skill information panel while the skill was active.</li>\n<li>Fixed a bug where the Crystalline Potential Gemling Legionnaire Ascendancy Passive Skill would cause un-equipped ammo to be set to 0 upon entering a new area.</li>\n<li>Fixed an issue in couch co-op where one player was able to interact with the Map Device but not open a Map due to them not being the party leader. In couch co-op, Map owners are now made to be the party leader.</li>\n<li>Fixed various couch co-op bugs where player 2 would open user interface elements of player 1, such as the Endgame Map.</li>\n<li>Fixed a bug in couch co-op where player 2 was not able to perform fast-travelling between checkpoints.</li>\n<li>Fixed an issue where you could not view the benefits from Quality on Gems when using a controller.</li>\n<li>Fixed a bug where the \"you have died\" screen could persist after being revived in the Arbiter of Ash Boss fight when using a controller.</li>\n<li>Fixed a bug where charges were not orbiting the Planetary Orb Character Effect microtransactions correctly. </li>\n<li>Fixed several client and instance crashes. This includes a potential fix for the crash affecting players on Windows 24H2.</li>\n</ul>",
    "author": "Kieren_GGG",
    "replies": 446,
    "lastReplyBy": "ravenka#7579",
    "lastReplyDate": "Feb 7, 2025, 10:51:55 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3714228",
    "title": "0.1.1b Hotfix",
    "date": "Jan 31, 2025, 5:26:02 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3714228",
    "content": "<h3>0.1.1b Hotfix</h3><br>\n<ul>\n<li>Fixed a common client crash.</li>\n</ul><br>\nYou will need to restart your clients to receive this client fix.<br>\n<br>\n<strong>Edit:</strong> There was a problem with the deploy of this on Steam, this should now be fixed by updating.",
    "author": "Kieren_GGG",
    "replies": 135,
    "lastReplyBy": "Kupemeu#4587",
    "lastReplyDate": "Feb 4, 2025, 8:36:52 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3707604",
    "title": "0.1.1b Patch Notes (restartless)",
    "date": "Jan 23, 2025, 9:53:56 PM",
    "url": "https://www.pathofexile.com/forum/view-thread/3707604",
    "content": "<h3>0.1.1b Patch Notes</h3><br>\n<ul>\n<li>Added a new client command line option which sends us additional debug information (API markers, NVIDIA Nsight Aftermath, and DRED) from DirectX 12 client crashes. If you're experiencing a large number of crashes and using DirectX 12, then temporarily enabling this will assist us in identifying the cause. This can be enabled by adding \"--ex-crash-report\" to your Path of Exile 2 command line arguments/launch options.</li>\n<li>Fixed a bug where on rare occasions Zarokh, the Temporal could kill all targets of the hourglass time trial skill without giving a chance to avoid it.</li>\n<li>Fixed a bug where Una was not playing the audio for her song selections.</li>\n<li>Fixed a client crash related to checkpoint UI.</li>\n<li>Fixed an instance crash.</li>\n</ul><br>\n<br>\nThis patch has been deployed without restarting the servers. You will need to restart your client to receive the client changes in this patch.",
    "author": "Kieren_GGG",
    "replies": 258,
    "lastReplyBy": "denislavevgeniev#3802",
    "lastReplyDate": "Feb 3, 2025, 7:48:38 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3704595",
    "title": "0.1.1 Hotfix 4",
    "date": "Jan 21, 2025, 1:36:52 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3704595",
    "content": "<h3>0.1.1 Hotfix 4</h3><br>\n<ul>\n<li>Fixed a bug where trading was not calculating the amount of free space correctly when using the Titan Inventory Expansion.</li>\n</ul>",
    "author": "Kieren_GGG",
    "replies": 74,
    "lastReplyBy": "Pkay#0596",
    "lastReplyDate": "Jan 23, 2025, 11:27:23 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3703054",
    "title": "0.1.1 Hotfix 3",
    "date": "Jan 20, 2025, 2:20:31 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3703054",
    "content": "<h3>0.1.1 Hotfix 3</h3><br>\n<ul>\n<li>Fixed Jamanra, the Risen King's zombie skirt once more, as it was still spontaneously exploding on death.</li>\n<li>Fixed another bug where characters with specific quest states were incorrectly receiving \"You do not have the required quest state\" errors.</li>\n<li>Fixed a bug that could sometimes prevent you from leaving the boss arena in the Burial Bog Map.</li>\n<li>Fixed several instance crashes.</li>\n</ul><br>\n<br>\n<strong>Edits:</strong><br>\nJan 20, 2025 2:51 AM (GMT): This hotfix was causing crashes and has now been rolled back. <br>\nJan 20, 2025 4:00 AM (GMT): Hotfix now redeployed, without the crashes.",
    "author": "Kieren_GGG",
    "replies": 192,
    "lastReplyBy": "blink4125#1299",
    "lastReplyDate": "Jan 26, 2025, 8:36:39 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3697854",
    "title": "0.1.1 Hotfix 2",
    "date": "Jan 17, 2025, 7:50:34 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3697854",
    "content": "<h3>0.1.1 Hotfix 2</h3><br>\n<ul>\n<li>Temporarily disabled some elemental explosions from Rare Monster minions due to them being invisible when destroying the corpse on kill, most commonly through methods like shatter.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 117,
    "lastReplyBy": "monokrome#8915",
    "lastReplyDate": "Jan 25, 2025, 4:01:44 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3697242",
    "title": "0.1.1 Hotfix",
    "date": "Jan 17, 2025, 1:24:38 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3697242",
    "content": "<h3>0.1.1 Hotfix</h3><br>\n<ul>\n<li>Fixed a bug where Shockwave Totem would sometimes fail to attack if surrounded by enemies or if there were no nearby enemies at all.</li>\n<li>Fixed a bug where Scavenged Plating could grant stacks above its Maximum of 10.</li>\n<li>Fixed a bug where characters with specific Act 3 quest states were receiving \"You do not have the required quest state\" errors.</li>\n<li>Fixed a bug where the Sulphuric Caverns Map was not spawning both bosses.</li>\n<li>Fixed an instance crash.</li>\n</ul><br>\n<br>\nThe fixes in this hotfix have been applied to new instances.",
    "author": "Kieren_GGG",
    "replies": 76,
    "lastReplyBy": "Psaakyrn#4256",
    "lastReplyDate": "Jan 18, 2025, 5:54:30 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3696353",
    "title": "0.1.1 Patch Notes",
    "date": "Jan 16, 2025, 8:00:07 PM",
    "url": "https://www.pathofexile.com/forum/view-thread/3696353",
    "content": "<h3>0.1.1 Patch Notes</h3><br>\nThis patch contains new endgame tower maps, checkpoints for map areas, respawn attemps for the Arbiter of Ash, as well as many monster changes, unique changes, improvements and bug fixes.<br>\n<br>\n<strong>Endgame Changes</strong><br>\n<br>\n<ul>\n<li>Added 4 new Tower Map areas: Alpine Ridge, Bluff, Mesa, and Sinking Spire.</li>\n<li>The Lost Towers Map area has also been revamped.</li>\n<li>To address the problem of only having one attempt at the Arbiter of Ash Boss fight, you will now have up to five respawn attempts at this fight. Respawns can only be triggered by the person who put in the keys, and everyone in your party will be respawned at the same time. Leaving the Map still forfeits your attempt so you'll still need to fight the boss with the build you walked into the Map with. Higher difficulties of the Boss will lower the number of respawn attempts you receive. We'll be looking to add respawn attempts to other Pinnacle content over time.</li>\n<li>The Arbiter of Ash can no longer be interrupted during his falling flame seed skill. His flaming gale skill can no longer be blocked.</li>\n<li>The Arbiter of Ash Boss is now invulnerable for longer during its emergence and now takes significantly reduced damage while emerging.</li>\n<li>The Arbiter of Ash is now way less likely to target minions when using his sword, which could prevent some of their skills being used.</li>\n<li>Added checkpoints to Map areas.</li>\n<li>Map areas now contain a minimum of 3 Rare Monsters.</li>\n<li>Citadels can now appear closer to the Ziggurat Refuge.</li>\n<li>Improved the visibility of Citadels on the Endgame Map.</li>\n<li>Maps now display their Biome when hovered in the Atlas UI.</li>\n<li>Added the new Overseer's Precursor Tablet, a currency item which can be placed in completed Towers to add Map Bosses to valid Maps in radius. These tablets drop from Map Bosses, and can roll exclusive modifiers that affect Map Bosses.</li>\n<li>Map areas have been adjusted to have more distinct specialities for the content they contain. For example, one Map area might have more total number of monsters, while another is more likely to contain additional content such as Strongboxes, Essences or Shrines. Generally speaking, the more difficult a Map is to clear, or the smaller it is, the more axes it will specialise in. Here's an overview of changes we've made to give Maps more discernibility:</li>\n<li><ul><li>A number of Maps now spawn up to double the number of Chests, and twice as many minimum Magic or Rare Chests.</li>\n<li>A number of Maps now contain up to double the number of Monsters.</li>\n<li>A number of Maps now contain 50% more Magic Monsters.</li>\n<li>A number of Maps now contain 50% more Rare Monsters.</li>\n<li>A number of Maps now have a higher minimum number of Rare Monsters you will encounter.</li>\n<li>A number of Maps now have a lower minimum number of Rare Monsters you will encounter.</li>\n<li>A number of Maps now have 50% more chance to contain Essences.</li>\n<li>A number of Maps now have 50% more chance to contain Strongboxes.</li>\n<li>A number of Maps now have 50% more chance to contain Shrines.</li>\n<li>Maps that are only exclusively found in Biomes containing Citadels now have 50% more chance to contain Essences, Strongboxes and Shrines.</li>\n<li>Unclaimed Hideout Areas now have substantially more Magic Monsters, and fewer Rare Monsters.</li>\n<li>Monsters in the Untainted Paradise have been breeding. Untainted Paradise now contains 100% more Monsters, of which spawn 100% more (thus quadruple) Magic and Rare Monsters.</li></ul></li>\n<li>Improved the highlightability/clickability of Shrines.</li>\n<li>Reduced the damage scaling of Monsters in Simulacrum encounters with added Difficulty.</li>\n<li>Adjusted the chance for Maps to contain Bosses, you should be encountering a Boss roughly every 1 in 4 Maps.</li>\n<li>The chance for Map Bosses to drop a Waystone of the current tier or higher has been reduced to account for the increase in total number of Map Bosses.</li>\n<li>The Radiant Waystones Atlas Notable Passive now provides +15% chance for Map Bosses to drop a Waystone of the current tier or higher (previously 25%).</li>\n<li>The small Map Boss Waystone Chance Passives now provide +6% chance for Map Bosses to drop a Waystone of the current tier or higher (previously 10%).</li>\n<li>The \"I'm not afraid of you!\" Delirium Atlas Passive Skill now grants \"Delirium Bosses in your Maps drop 100% increased Simulacrum Splinters\" (previously 50%).</li>\n<li>Reduced the number of monsters and small chests from Breaches by 15%.</li>\n<li>Increased the amount of Simulacrum Splinters found in Maps by 20%.</li>\n<li>Added dedicated 2D art for Waystones that are instilled with layers of Delirium.</li>\n<li>Crisis Fragments, Breachstones, Simulacrums, and An Audience with the King now have a more appropriate gold value to vendors.</li>\n<li>Increased how far you can zoom out on the Endgame Map on keyboard and mouse input, to match the zoom level on controller input.</li>\n</ul><br>\n<strong>Skill Changes</strong><br>\n<br>\n<ul>\n<li>Supercharged Slam now has \"Each successive aftershock gains +0.5 metres to radius, up to 3 metres (previously uncapped).</li>\n<li>Scavenged Plating now grants you stacks for a duration based on the enemy's rarity. Normal enemies grant 1 stack, Magic enemies grants 2 stacks, Rare enemies grant 5 stacks, and Unique enemies grant 10 stacks.</li>\n<li>The Lightning Bolt Skill granted by the Choir of the Storm Unique Amulet has been renamed to Greater Lightning Bolt to differentiate it from the Skill granted by Staves. Triggered Greater Lightning Bolts are now unable to trigger a subsequent Greater Lightning Bolt if the first was a Critical Hit. Greater Lightning Bolt now deals roughly 3.5 times more base Lightning Damage compared to Lightning Bolt.</li>\n<li>The Temporalis Unique Body Armour can no longer reduce the cooldown of a Skill to below 100ms.</li>\n<li>Skills socketed in a Meta Gem's sockets can no longer gain energy.</li>\n<li>Clarified Vine Arrow's description to explicitly state that it hits enemies on landing.</li>\n<li>Removed the Aura tag from Pain Offering for consistency with other minion skills, as the skill does not directly create an Aura (the Aura is created by the summoned minion).</li>\n\n</ul><br>\n<strong>Monster Changes</strong><br>\n<br>\n<ul>\n<li>Monsters now have increased Toughness per Essence modifier affecting them.</li>\n<li>Added a small delay before monsters released from Essence Monoliths can use their skills.</li>\n<li>Forsaken Miners now throw less grenades, which have also had their damage reduced and their visuals improved.</li>\n<li>Rudja, the Dread Engineer's grenades now deal less damage in Cruel and Maps.</li>\n<li>Reduced how far away Faridun Plaguebringers can use their Detonate Dead skill from. The telegraphing for this skill has been improved.</li>\n<li>Reduced how far away Lost-men Zealots can use their Meteor skill from. The visuals of this skill have also been improved.</li>\n<li>The Lightning Storm skill used by Lost-men Zealots should now always strike at the telegraphed marker, as opposed to somewhere random.</li>\n<li>Filthy Crone no longer uses their Projectile Vomit skill point blank in front of you (because that's just rude), and now has a basic projectile attack.</li>\n<li>Reduced the leap distance of Vile Vulture's Leap skill. The visuals of this skill have also been improved.</li>\n<li>Reduced the axe throwing distance of Vaal Axemen.</li>\n<li>Reduced the area of effect for Filthy First-born's on-death explosion. The visibility of the area of effect has also been improved.</li>\n<li>The vomit skill used by Rotting Hulks and Bog Hulks now deal less damage, and can no longer be used point blank in front of you.</li>\n<li>Adjusted the damaging area of The Bloated Miller's slam skills to more closely match the visual effects.</li>\n<li>Adjusted the damaging area of Zalmarath, the Colossus' attacks to more closely match the visual effects.</li>\n<li>Adjusted the player targeting behaviour for Zalmarath, the Colossus. Their arms are no longer targetable.</li>\n<li>Adjusted the damaging area of Bahlak, the Sky Seer's Tornadoes to more closely match the visual effects. Tornadoes now push you slightly away when they appear, and now deal less damage when they first appear before ramping up.</li>\n<li>Reduced how often Prowling Shades can use their invisibility skill.</li>\n<li>Adjusted the frequency of some monsters such as Prowling Shades and Gelid Zealots.</li>\n<li>Vaal Zealots are now less likely to repeatedly use their Eye of Winter skill.</li>\n<li>Improved the visual effects of Fiery Zealots' Fire Storm skill.</li>\n<li>Adjusted the damaging area of the Executioner's attacks to more closely match the visual effects. The telegraphing for his Guillotine Slam has also been improved.</li>\n<li>Improved the visibility of Cultists Archers' skills. Their Toxic Rain skill also now deals less damage.</li>\n<li>Jamanra, the Risen King's zombie skirt no longer spontaneously explodes on death.</li>\n<li>Mighty Silverfist's Commando Roll skill now deals significantly less damage.</li>\n<li>Reduced how often Azak Stalkers use their Slam skill.</li>\n<li>Walking Goliaths no longer deal damage twice when they fall over. Their slam now deals more damage in the centre, and less around the edges.</li>\n<li>Reduced the distance of which Urnwalkers in the Trial of the Sekhemas are able to initiate their skill. We've also fixed an issue where they were not dealing damage correctly, meaning they now deal more damage.</li>\n<li>Slitherspitters no longer deal damage twice with their projectile attack. Their melee attack now deals Physical damage instead of Chaos.</li>\n<li>The density of monsters in Utzaal has been reduced. Monsters contained in the area are now more likely to be of a weaker variety.</li>\n<li>The density of monsters in Dreadnaught areas has been adjusted to result in less swarming encounters.</li>\n<li>Improved the telegraphing for Azak Shamans' Detonate Dead skill.</li>\n<li>Improved the telegraphing for the crystals left by Vaal Goliaths when they die.</li>\n<li>Chaos Pustules in Ritual encounters have had their visuals improved.</li>\n<li>The Impending Doom modifier in the Trial of Chaos now has more time before it explodes and has had its visuals improved.</li>\n<li>Improved the telegraphing of the anchor drop from monsters affected by Essence of Torment.</li>\n<li>Improved the visuals of the area of effect from monsters affected by Essence of Electricity. The time before the area of effect explodes has also been increased.</li>\n<li>Volatile Plants are now much more noticeable both before and as they're about to explode.</li>\n<li>Elemental explosions caused by minion death or those periodically cast by a Rare Monster have had their visual effects improved. The delay before these explode has also been increased.</li>\n<li>The Aura from the \"Prevents Recovery Above 50%\" Monster modifier now has a visible radius.</li>\n<li>Energy Shield modifiers on Monsters now provide far more sensible levels of Energy Shield.</li>\n<li>The Shielding Monsters modifier has been reenabled in the Trial of Chaos.</li>\n</ul><br>\n<strong>General Changes and Improvements</strong><br>\n<br>\n<ul>\n<li>Enabled migrating from Solo-Self Found Leagues to their corresponding parent leagues (Standard or Hardcore). This can be done from the League Migrations button on the Character Selection screen.</li>\n<li>Strongboxes have been adjusted to spawn waves of enemies over a much shorter period of time. </li>\n<li>The Strongbox fog effect now fades away once all the waves of enemies have been spawned.</li>\n<li>Significantly increased the chance to encounter Research Strongboxes.</li>\n<li>Added a visual effect to distinguish which Monsters have been spawned by a Strongbox.</li>\n<li>The Volcanic Crag, Lightning Storms, Ice Spikes and Chaos Barrage Strongbox modifiers have all been adjusted to activate after a delay.</li>\n<li>Charms now play an effect on your character when they are automatically used.</li>\n<li>Socketables such as Runes can now be overwritten by placing another socketable item into the socket.</li>\n<li>Attempting to Salvage an item now highlights which items in your inventory can be salvaged and displays item sockets.</li>\n<li>Flasks with Quality are now able to be salvaged.</li>\n<li>Armour has been made more effective, by approximately 15%.</li>\n<li>More Monsters are now able to be pushed while dodge rolling. This generally applies to most Monsters smaller than a Skeleton.</li>\n<li>Objects such as Delirium Shards can no longer be pushed by other Monsters.</li>\n<li>Increased the chance for Omens to appear as Ritual Rewards.</li>\n<li>Reduced the chance for items to roll some of the less-desirable item modifiers.</li>\n<li>Distilled Emotions required to instill a Passive Skill onto an Amulet are now only displayed on the Passive Skill Tree after you have picked up your first Distilled Emotion.</li>\n<li>Added an exit portal to the Trialmaster arena.</li>\n<li>Removed the level requirement to access Expedition Vendors.</li>\n<li>Rarity of items in Expedition Vendor shops now increases with shop level, so shops generally have more rare items at higher levels. This doesn't affect existing shops, and you will need to use a reroll currency to generate shops with the improved rarity.</li>\n<li>Reduced visual clutter in many Map areas to improve the visibility of skills and effects.</li>\n<li>Added a tutorial for activating your first persistent buff skill gem.</li>\n<li>Improved and fixed inconsistencies for walkability throughout areas in the campaign as well as maps.</li>\n<li>Improved the loading time of the World Map.</li>\n<li>Reduced the initial player revive time to 2.5 seconds (previously 3 seconds).</li>\n<li>Reduced the player revive time penalty to 1.5 seconds per death (previously 2 seconds).</li>\n<li>Alva now has an option to gamble for items when placed in your Hideout.</li>\n<li>Reviving Minions that died from being out-of-range of you now instead immediately revive near you.</li>\n<li>The Quest Tracker now shows which quests are applicable for the area you're currently in.</li>\n<li>Uncut Gems now show their level on the item label.</li>\n<li>Charms now display their number of charges and when they're active.</li>\n<li>Updated the world Map icons for when you have completed quests, encounters and found items to make it more clear they have been completed.</li>\n<li>Added propogating Weapon Effect options to the Cosmetic Panel UI.</li>\n<li>The Erian's Cobble, Heartbound Loop, Ironride, and Myris Uxor Uniques have received 2D art.</li>\n<li>The Hand of Wisdom and Action Unique has received 3D art.</li>\n<li>Added flavour text for the Edyrn's Tusks and Splinterheart Uniques.</li>\n<li>After activating an Omen of Whittling, hovering over an item before applying a Chaos Orb to it will now display which modifier will be rerolled.</li>\n<li>Improved performance of the Xyclucian, the Chimera boss fight.</li>\n<li>Improved performance of the lava in The Molten Vault.</li>\n<li>Reduced screen clutter and improved performance of the effect that plays when killing rare monster objectives in endgame maps.</li>\n<li>Improved performance of areas with very bright lights that cast many shadows (notably the Temple of Kopec and The Ziggurat Refuge).</li>\n<li>Improved the performance of The Ziggurat Encampment in order to reduce the occurence of unloaded textures.</li>\n<li>Burning Ground can no longer spawn underneath interactables, such as levers. </li>\n<li>Monsters can no longer spawn near the close to the entrance of a map. This often caused the player to be immediately be attacked upon moving.</li>\n<li>Added keyword for Honour Resistance.</li>\n<li>Delirium Monsters are no longer untargetable during their emerge animation, as a result they should no longer push you during this. </li>\n<li>You can now pick up items and interact with some objects while performing other actions.</li>\n<li>The \"Attack in place stops movement\" option no longer prevents walking on skills that can be used while moving while using WASD movement.</li>\n<li>Continued to incrementally improve the sound, art, effects and environments.</li>\n</ul><br>\n<strong>Unique Item Changes</strong><br>\n<br>\n<ul>\n<li>The Alkem Eira Unique Shield now provides +50-70 to maximum Mana (previously +15-30). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Arvil's Wheel Unique Shield no longer has 40-60% increased Block chance. It now provides +40-60 to maximum Life and +40-60 to maximum Mana.</li>\n<li>The Ashrend Unique Body Armour now provides 30-40% to Fire Resistance (previously 20-30%) and 10-20 to Strength.</li>\n<li>The Asphyxia's Wrath Unique Quiver now adds 3-4 to 5-8 Cold Damage to Attacks.</li>\n<li>The Atsak's Sight Unique Helmet now provides 30-40% increased Critical Hit chance (previously 20-40%), and 100-150% increased Evasion and Energy Shield.</li>\n<li>The Atziri's Acuity Unique Gloves now provides 30-50% increased Critical Hit chance (previously 20-30%). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Barrow Dweller Unique Body Armour now provides \"Damage of Enemies Hitting you is Unlucky while you are on Low Life\".</li>\n<li>The Belly of the Beast Unique Body Armour now has 25-30 to 35-40 Physical Thorns Damage.</li>\n<li>The Birth of Fury Unique Boots now provide 20% increased Movement Speed (previously 15%), and 20-30% to Fire Resistance (previously 10-20%). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Black Doubt Unique Body Armour now provides 10-20% to Cold Resistance.</li>\n<li>The Blackbraid Unique Body Armour now provides +40-60 to Armour, and +10% to Elemental Resistances.</li>\n<li>The Blackgleam Unique Quiver now adds 3-5 to 6-9 Fire Damage to Attacks.</li>\n<li>The Blackheart Unique Ring now adds 4-6 to 8-10 Chaos Damage to Attacks (previously 2-3 to 4-5). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Blood Thorn Unique Quarterstaff now adds 8-12 to 16-18 Physical Damage (previously 3-5 to 9-11). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Blueflame Bracers Unique Gloves now provide +20 to maximum Energy Shield.</li>\n<li>The Bones of Ullr Unique Boots now provide +20-40 to Maximum Life and maximum Mana (both previously +25). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Brain Rattler Unique Mace now adds 18-22 to 24-28 Physical Damage (previously 10-12 to 18-22), and adds 1 to 50-55 Lightning Damage (previously 1 to 36-42). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Bramblejack Unique Body Armour now provides +60-100 to maximum Life (previously +50-80), Cannot Evade and Regenerate 5% of Life per second while Surrounded</li>\n<li>The Brass Dome Unique Body Armour now has 400-500% increased Armour (previously 300-400%) and -5 to -1 to all Maximum Elemental Resistances (previously -5%). Existing versions of this Unique can be updated using a Divine Orb.</li>\n<li>The Briarpatch Unique Boots now provide 10-15 to 20-25 Physical Thorns damage.</li>\n<li>The Briskwrap Unique Body Armour now has 60-100% increased Evasion.</li>\n<li>The Bristleboar Unique Body Armour now has 50% reduced Evasion Rating (previously 40-80% increased), and now causes you to gain 5 Rage when Hit by an Enemy (previously 3). It also now provides 3-5 Life Regeneration per Second.</li>\n<li>The Bronzebeard Unique Helmet now provides +100 to maximum Life (previously +40-60). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Brynabas Unique Belt now provides 30-40% increased Lightning Resistance (previously 20-30%). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Brynhand's Mark Unique Mace now has 10-14 to 16-20 added Physical Damage (previously 3-4 to 6-8), +10-20 to Strength (previously +5-10), and now has 20% reduced Attack Speed.</li>\n<li>The Burrower Unique Ring now has -10% to Cold Resistance (previously -15 to -10%), and 30-50% increased Mana Regeneration Rate (previously 25-35%). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Candlemaker Unique Gloves now provides 20-40% to Fire Resistance (previously 15-30%), and -10 to -20% to Cold Resistance (previously -15 to -30%). It also now provides 20-40% increased Fire Damage and 10-20% reduced Cold Damage.</li>\n<li>The Carrion Call Unique Focus now causes Minions to have 20-30% increased Damage.</li>\n<li>The Chober Chaber Unique Mace no longer has 80-120% increased Physical Damage or +5% Critical Hit Chance, it instead adds 58-65 to 102-110 Physical Damage and +50 to Spirit.</li>\n<li>The Corona of the Red Sun Unique Helmet now provides 20-25% to Fire Resistance.</li>\n<li>The Crown of the Pale King Unique Helmet now provides 10-15 to 20-25 Physical Thorns damage.</li>\n<li>The Dancing Mirage Unique Body Armour now has 150-200% increased Evasion and Energy Shield (previously 60-100%). Existing versions of this item can be updated with a Divine Orb.</li>\n<li>The Dark Defiler Unique Sceptre now has \"Gain 5% of Damage as Chaos Damage per Undead Minion\" (previously 3%). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Deathblow Unique Gloves now provide 5-10% increased Attack Speed.</li>\n<li>The Defiance of Destiny Unique Amulet now causes you to recover 10% of Missing Life before being Hit by an Enemy (previously 5%). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Deidbell Unique Helmet now provides +10-20 to Strength.</li>\n<li>The Devouring Diadem Unique Helmet now provides +40-60 to maximum Life.</li>\n<li>The Dionadair Unique Shield now provides 20% reduced Stun Threshold (previously 30%), and now provides 3-5 Life Regeneration per Second.</li>\n<li>The Doedre's Tenure Unique Gloves now provide 20-30 to maximum Energy Shield.</li>\n<li>The Doomgate Unique Shield now provides 13-17% to Chaos Resistance.</li>\n<li>The Edyrn's Tusks Unique Body Armour now has 50% chance to inflict Bleeding on Hit (previously 10%).</li>\n<li>The Elevore Unique Helmet now provides +20-30 to Dexterity (previously 10-20), and now provides +1 Charm slot.</li>\n<li>The Erian's Cobble Unique Helmet now provides +0-40 to Armour (previously +0-20), +0-30 to Evasion Rating and maximum Life (both previously +0-15), and +0-20 to maximum Energy Shield and maximum Mana (both previously +0-10). It now provides 0-10% to Fire Resistance, Cold Resistance, and Lightning Resistance (all previously 0-5%), 0-6 Life Regeneration per Second (previously 0-3), 0-60 to Accuracy Rating (previously 0-30), and +0-10 to Strength, Dexterity and Intelligence (all previously +0-5). In addition to the above, it also now provides 0-30% increased Critical Hit Chance (previously 0-15%), and 0-20% increased Rarity of Items found (previously 0-10%). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Eternal Spark Unique Focus now provides 40% increased Mana Regeneration Rate while stationary (previously 50%), and now also provides 40% increased Mana Regeneration Rate.</li>\n<li>The Ezomyte Peak Unique Helmet now provides +50-80 to maximum Life (previously 30-50), and also now provides 3-6 Life Regeneration per Second.</li>\n<li>The Feathered Fortress Unique Shield now provides 20-30% to Fire Resistance and Cold Resistance (both previously 10-20%), and +20-30 to Strength and Dexterity (both previously +10-20). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Forbidden Gaze Unique Helmet now provides 30-50% to Cold Resistance (previously 25-35%). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Frostbreath Unique Mace now has 8-12 to 16-20 added Physical Damage and Cold Damage (both previously 4-6 to 8-12). It now also provides +5% to Critical Hit Chance.</li>\n<li>The Gamblesprint Unique Boots now provide 15-25% to Lightning Resistance (previously 5-15%), and now provide 10-15% increased Item Rarity.</li>\n<li>The Gravebind Unique Gloves now provides 10-15% to Cold Resistance.</li>\n<li>The Grip of Winter Unique Gloves now provides 20-30% to Cold Resistance.</li>\n<li>The Gloomform Unique Body Armour now provides 10-20% to Fire Resistance.</li>\n<li>The Hoghunt Unique Mace no longer has 100-150% increased Physical Damage. Instead, it now adds 16-20 to 23-27 Physical Damage.</li>\n<li>The Hollow Mask Unique Helmet now provides 13% to Chaos Resistance.</li>\n<li>The Horns of Bynden Unique Helmet now provides +20 to Armour.</li>\n<li>The Hrimnor's Hymn Unique Mace now has 80-120% increased Physical Damage (previously 60-80%). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Husk of Dreams Unique Body Armour now provides 17-23% to Chaos Resistance (previously 13-17%), and 20-30% increased Flask Charges used (previously 25-50%). Existing versions of this item can be updated with a Divine Orb.</li>\n<li>The Immortan Unique Body Armour has been renamed to The Road Warrior. It no longer provides 50-100% increased Armour, and now provides 15-30% to Fire Resistance and Lightning Resistance (both previously 15-25%). It also now provides 10-15 Life Regenerated per Second, and +10-15 to all Attributes.</li>\n<li>The Infernoclasp Unique Belt now provides 30-50% to Fire Resistance (previously 25-35%). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Infinite Pursuit Unique Boots now provide 25% increased Movement Speed while affected by an Ailment (previously 20%). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Innsmouth Unique Helmet now provides +20-30 to Evasion Rating.</li>\n<li>The Irongrasp Unique Body Armour now provides +20-30 to Strength.</li>\n<li>The Ironride Unique Helmet now provides +30-50 to maximum Life.</li>\n<li>The Jarngreipr Unique Gloves now have 50% increased Armour and Evasion.</li>\n<li>The Keelhaul Unique Belt now has Life Flasks gain 0.25 charges per Second and Mana Flasks gain 0.25 charges per Second (both previously 0-0.25 charges per Second). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Killjoy Unique Gloves now provides 20-30% increased Critical Damage.</li>\n<li>The Knight-errant Unique Boots now provides +30-50 to Elemental Ailment Threshold.</li>\n<li>The Leer Cast Unique Helmet now provides +10-20 to Dexterity.</li>\n<li>The Legionstride Unique Boots now provides +50-70 to Armour instead of 50-80% increased Armour. They also now provide +50-70 to Stun Threshold (previously +30-50).</li>\n<li>The Lochtonial Caress Unique Gloves now provides +15-25 to Armour.</li>\n<li>The Luminous Pace Unique Boots now provides +20-30 to maximum Energy Shield.</li>\n<li>The Lycosidae Unique Shield now has \"Blocking Damage Poisons the Enemy as though dealing 200 Base Chaos Damage\" (previously 100). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Mask of the Sanguimancer now provides +20-25 to Evasion Rating, and +10-15 to maximum Energy Shield.</li>\n<li>The Matsya Unique Quarterstaff now has 6-9 to 10-15 added Cold Damage, and 1 to 19-29 Lightning Damage.</li>\n<li>The Mist Whisper Unique Crossbow now has 8-10 to 13-15 added Cold Damage (previously 4-6 to 9-12), and now provides 30% increased Chill Duration on Enemies.</li>\n<li>The Nazir's Judgement Unique Quarterstaff no longer has 80-120% increased Physical Damage, and instead adds 30-36 to 75-81 Physical Damage.</li>\n<li>The Necromantle Unique Body Armour now causes Minions to have 17-23% Chaos Resistance.</li>\n<li>The Northpaw Unique Gloves now adds 3-5 to 8-10 Physical Damage to Attacks (previously 2-3 to 5-6), and also now has +15-25 to Evasion Rating.</li>\n<li>The Original Sin Unique Ring no longer has \"Chaos Resistance is Zero\", and instead now provides 17-23% to Chaos Resistance.</li>\n<li>The Painter's Servant Unique Gloves no longer provides 5-10% to Fire, Cold or Lightning Resistance. They instead now provide 5-10% Elemental Damage gained as Fire Damage, 5-10% Elemental Damage gained as Cold Damage, and 5-10% Elemental Damage gained as Lightning Damage.</li>\n<li>The Pariah's Embrace Unique Body Armour now provides +10-15 to all Attributes.</li>\n<li>The Plaguefinger Unique Gloves now provides 20-30% chance to Poison on Hit (previously 5-10%). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Powertread Unique Boots now provides +12% to Critical Damage Bonus per Power Charge (previously +8%)</li>\n<li>The Prayers for Rain Unique Body Armour now provides 10-20% to Lightning Resistance.</li>\n<li>The Quatl's Molt Unique Body Armour now provides +60-80 to maximum Life (previously +30-50), and also now provides 60-80% increased Evasion Rating.</li>\n<li>The Quecholi Unique Mace now has 100-150% increased Physical Damage (previously 80-120%).</li>\n<li>The Seeing Stars Unique Mace now adds 12-16 to 22-25 Cold Damage (previously 9-12 to 18-22), and now adds 1 to 40-45 Lightning Damage (previously 1 to 30-35). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Sentry Unique Quarterstaff now has 25-32 to 40-50 added Fire Damage (previously 8-2 to 16-20). It now has no Physical Damage, and adds +30-50 to Accuracy Rating.</li>\n<li>The Sierran Inheritance Unique Body Armour now provides 30-40% to Lightning Resistance (previously 15-25%), and now has -15% to Cold Resistance.</li>\n<li>The Smiling Knight Unique Helmet now provides 150-200% increased Armour and Evasion (previously 30-50%). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Snakebite Unique Gloves now provides 20-30% chance to Poison on Hit (previously 20%), and also now provides 6-10 Life Regenerated per Second.</li>\n<li>The Splinterheart Unique Bow now has 120-160% increased Physical Damage (previously 60-80%). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Tetzlapokal's Desire Unique Body Armour now provides +20-30 to Intelligence.</li>\n<li>The Thunderstep Unique Boots now provide 10-20% increased Movement Speed (previously 10-15%), and 30-50% to Lightning Resistance (previously 25-35%). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Titanrot Cataphract Unique Body Armour now provides 400-500% increased Armour (previously 200-300%), and 15-30% increased Strength (previously 10-20%). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Trampletoe Unique Boots now provide 15% increased Movement Speed (previously 10%). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Treefingers Unique Gloves now adds 6-10 to 12-16 Physical Damage to Attacks (previously 3-5 to 6-8), it  also now provides 20-30% increased Stun Buildup and 5% reduced Attack Speed.</li>\n<li>The Trenchtimbre Unique Mace now adds 13-15 to 22-25 Physical Damage (previously 10-12 to 18-22). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Trephina Unique Mace now adds 12-25 to 22-25 Physical Damage (previously 7-10 to 12-18). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Ungil's Harmony Unique Amulet now provides 100-200% increased Critical Hit Chance (previously 100%). Existing versions of this item can be updated using a Divine Orb.</li>\n<li>The Visage of Ayah Unique Helmet now provides 10-20% to Lightning Resistance.</li>\n<li>The Voll's Protector Unique Body Armour now provides 13-17% to Chaos Resistance.</li>\n<li>The Wake of Destruction Unique Boots now provide 10% increased Movement Speed.</li>\n<li>The Wandering Reliquary Unique Body Armour now has +60-80 to Stun Threshold.</li>\n<li>The Windscream Unique Boots now provide 10-20% increased Movement Speed (previously 10-15%),  and also now causes Curse Skills to have 10-20% increased Cast Speed.</li>\n<li>The Wings of Caelyn Unique Helmet now provides +20 to Armour.</li>\n<li>The Wondertrap Unique Boots now provides 10-20% increased Movement Speed (previously 5-15%), +10-20 to Strength, Dexterity and Intelligence (all previously +5-15), and also now provides +30-50 to maximum Energy Shield.</li>\n<li>The Wylund's Stake Unique Mace now has 4-6 to 8-10 added Physical Damage and Fire Damage (both previously 2-3 to 4-5). It now also provides 20-30% to Fire Resistance, and +10-20 to Strength.</li>\n\n</ul><br>\n<strong>Bug Fixes</strong><br>\n<br>\n<ul>\n<li>Fixed four client crashes.</li>\n<li>Fixed four instance crashes.</li>\n<li>Fixed a bug where Mana Flare, Elemental Discharge, and the version of Ember Fusillade triggered by Dusk Vigil were not considered triggered skills (and therefore could be supported by some supports they don't apply to triggered skills)</li>\n<li>Fixed a bug where some objects, such as Vine Arrow plants, were incorrectly counted as targets when dealing splash damage through the implicit modifier on the Cultist Greathammer base type.</li>\n<li>Fixed a bug where Siege Cascade was targeting Vine Arrow plants and Frostwall Ice Crystals.</li>\n<li>Fixed a bug where Herald of Ice was still exploding shattered enemies when the gem was set to be used with your currently inactive weapon set.</li>\n<li>Fixed a bug where Concoction Skills were considered Bow Skills and as a result could be affected by \"increased damage with Bow Skills\" modifiers on Quivers.</li>\n<li>Fixed a snapshotting issue with Energy Shield when using the Mask of the Stitched Demon Unique as an Infernalist.</li>\n<li>Fixed a bug where Minion Pact Support was able to drain the Life of Lingering Illusions.</li>\n<li>Fixed a bug where tier 5 Bows could not roll increased Attack Speed, and tier 5 Rings could not roll maximum Life.</li>\n<li>Fixed a bug where you could briefly be unable to perform any skills if you tried to interact with an object and dodge rolled at the same time.</li>\n<li>Fixed an issue where the checkpoint for the Temple of Kopec Boss fight could sometimes take you to the first checkpoint in the area.</li>\n<li>Fixed a bug preventing the quality bonuses on Shockburst Rounds and Hailstorm Rounds from applying.</li>\n<li>Fixed a bug where Shockwave Totem did not work when used with the Support Gem \"Astral Projection\".</li>\n<li>Fixed a client crash that could occur with Power Siphon while holding a Shield.</li>\n<li>Fixed a client crash that could occur in couch co-op when interacting with the Unique Stash Tab.</li>\n<li>Fixed a client crash that could occur in couch co-op when interacting with the Corruption Altar.</li>\n<li>Fixed a bug where Vine Arrow was not slowing enemies.</li>\n<li>Fixed a bug that caused Sekhema Asala to fail to shield you during Jamanra, the Abomination's storm skill.</li>\n<li>Fixed a bug where terrain generation for the client can get out of sync with the server for Trial of the Sekhemas.</li>\n<li>Fixed a bug where the influence range of Lost Towers could fail to display when interacting with the map device in your Hideout.</li>\n<li>Fixed a bug where Crossbows could fail to reload if the player did not have enough mana available. </li>\n<li>Fixed a bug where Spark could fail to cast while standing on the edge of walkable terrain.</li>\n<li>Fixed a bug where Temporal Chains' debuff icon was not displaying the correct description when hovered over.</li>\n<li>Fixed a bug where the unique item \"Fireflower\" could fail to cause Fire Damage to the player when an enemy was ignited.</li>\n<li>Fixed a bug where Ghost Dance would remain active when the player no longer met the spirit requirements. </li>\n<li>Fixed a bug where \"The Way Forward' Atlas Passive would cause The Arbiter of Ash to drop Tier 16 Waystones instead of Tier 15. </li>\n<li>Fixed a bug where some unique bows did not play audio when firing arrows.</li>\n<li>Fixed a bug where engraving a support gem did not play audio.</li>\n<li>Fixed a bug where quest items would not drop again from their respective objective if the player dropped them on the ground in an area where the difficulty was different to where it was obtained. Characters in a broken state should now be able to re-obtain the quest objective.</li>\n<li>Fixed a bug where some interactables couldn't be cancelled by using dodge roll.</li>\n<li>Fixed a bug where using a flask could cause the player to lose life if item stat requirements weren't met in both weapon sets.</li>\n<li>Fixed a bug where friends would show as offline when they changed character.</li>\n<li>Fixed a bug where the Intro Cinematic did not play on the PC Platform.</li>\n<li>Fixed a bug where incomplete unique items could be obtained.</li>\n<li>Fixed some wonky interactions with the additional inventory slots from the Titan's Colossal Capacity Ascendancy Passive Skill.</li>\n<li>Fixed a bug where The Hooded One would not identify items stored in additional inventory slots granted by the Colossal Capacity Titan Ascendancy Passive Skill.</li>\n<li>Fixed a bug so the inventory no longer opens when dragging the Atlas Map UI with the cursor over a Map node.</li>\n<li>Fixed a visual bug where walking away from a corpse and back to it could visually display a new remnant with Grim Feast.</li>\n<li>Fixed a bug in the Riverside Map where the boss arena forcefield could appear before entering the boss fight.</li>\n<li>Fixed a bug where the Energy Shield UI could visually appear as having Energy Shield when the player had none.</li>\n<li>Fixed a bug where enemies could cast detonate dead on players minions when the player was using the Sacrifice Gem.</li>\n<li>Fixed problems in the Savanna, Abyss, and Seepage Maps where sections of the areas could be unaccessible</li>\n<li>Fixed a bug where the unique item \"Corpsewade\" did not work when the player was using the King of the Faridun Body Armour Microtransaction.</li>\n<li>Fixed a bug with the Hateforge Unique where negative values of the \"to Maximum Rage\" Modifier caused the Modifier to not show.</li>\n<li>Fixed a bug where Blink allowed travel to the past in the Ziggurat Encampment without traversing through the Time Portal.</li>\n<li>Fixed a bug within the Instilling UI that displayed a Tainted Oil slot, which doesn't exist. </li>\n<li>Fixed a bug where allocating Chaos Inoculation would incorrectly count you as being on Low Mana.</li>\n<li>Fixed a bug where Crossbow Skills could fail to reload when spamming the ability when using a controller. </li>\n<li>Fixed a bug when stashing a Skill Gem with attached Support Gems would cause the Support Gems to become invisible. These now unpack into the relevant tab.</li>\n<li>Fixed the alignment of Mirror of Kalandra within the Currency Stash Tab.</li>\n<li>Fixed a bug in the Vaal Factory map where some humanoid monsters would remain inactive. </li>\n<li>Fixed a bug where the \"Elemental Storm\" Gem had the Physical Tag.</li>\n<li>Fixed a bug where Gas Clouds could spawn in unwalkable terrain.</li>\n<li>Fixed a bug where minion objects could stretch into unwalkable terrain.</li>\n<li>Fixed a bug where the Burial Bog Map could generate with a broken loop.</li>\n<li>Fixed a bug where the World Map always opened displaying an above ground area, even when the player was in an underground area. </li>\n<li>Fixed a bug where strongboxes could fail to generate any monsters.</li>\n<li>Fixed a bug with dodge roll which allowed the player to roll through Bone Walls and Frost Walls.</li>\n<li>Fixed a bug with dodge roll which allowed the player to roll off of The Ardura Caravan Ramp.</li>\n<li>Fixed a bug where Soul Cores of Atmohua, Zantipi, or Cholotl could not be used for the 3:1 recipe.</li>\n<li>Fixed a bug with the Relic Modifier giving a chance to gain another key was incorrectly always applying.</li>\n<li>Skip tutorials no longer prevents you from leaving town without engraving a gem.</li>\n<li>Removed the redundant block chance description on Saffel's Frame Unique Item.</li>\n<li>Fixed a bug which could cause the landmark room chest in The Mausoleum of the Praetor from being opened.</li>\n<li>Fixed a bug where \"Elemental Storm\" was missing the triggered tag.</li>\n<li>Fixed a bug which allowed Glacial Cascade's hits to freeze enemies.</li>\n<li>Fixed a bug in the Trail of the Sekhamas where some traps' audio failed to play.</li>\n<li>Fixed a bug where \"Unbound Avatar\" could gain stacks from inanimate objects.</li>\n<li>Fixed a bug in the Temple of Chaos where leap slamming into an arena could cause the encounter to not complete.</li>\n<li>Fixed a bug where Damage Gained as Fire, Cold and Lightning were missing tags, causing Essences to be unable to roll these modfiiers.</li>\n<li>Fixed a bug where the Act 1 to Act 2 transition cinematic sometimes played when entering The Ardura Caravan rather than when travelling from Act 1. </li>\n<li>Fixed a bug where some loot in The Temple of Chaos could get stuck in blocking.</li>\n<li>Fixed a bug where a favored map slot UI notification would appear when corrupting a Tier 15 Waystone into a Tier 16. </li>\n<li>Fixed a bug which could prevent the player from returning to the Vastiri Outskirts if they travelled there by warping to a party member, then warping to a different party member in Act 1.</li>\n<li>Fixed a bug where Supercritical support's 2D art was not displaying in some cases.</li>\n<li>Fixed a bug where expedition chests in maps were not displaying their rarity.</li>\n\n</ul><br>\n<strong>Controller Improvements</strong><br>\n<br>\n<ul>\n<li>While using currency, inventory navigation using RS will ignore items the currently selected currency could not be used on.</li>\n<li>Added a bindable action to show/hide item and object labels.</li>\n<li>While on the world map screen, you can now press B/circle to leave the underground.</li>\n<li>Some interactables in the Trial of the Sekhemas and the Trial of Chaos are now prioritised over using skills on enemies if you have Interact bound to the same button as a skill.</li>\n<li>The cosmetics tab of the navigation menu has been moved to the end, so that you no longer have to navigate through it to reach the quest or atlas tabs.</li>\n<li>Improved auto-targeting logic for very large bosses such as Tor Gul</li>\n<li>The game now pauses by default if a controller becomes disconnected, with an option in the Game tab to instead disconnect.</li>\n<li>Auto-targeting no longer aggressively prioritises larger enemies and objects (such as Tempest Bell).</li>\n<li>Pressing X/square while holding a stack of items now deposits a single item from the stack in the currently selected space.</li>\n<li>Hovering a support gem over a filled socket will now show the support gem currently in that socket.</li>\n<li>Trying to socket invalid gems using a controller now gives appropriate error messages.</li>\n<li>Switching to controller input on a character that was created with keyboard and mouse input no longer results in the character having no actions bound.</li>\n<li>Fixed a bug that prevented rerolling expedition vendors while using a controller. There is now also a dedicated button (Y/triangle) to reroll the vendor.</li>\n<li>Fixed a bug where the Gemling's Gem Studded notable passive was not accounted for when socketing support gems using a controller.</li>\n<li>Fixed a bug where the Lost Tower interface had inconsistent controls when using a controller.</li>\n<li>Fixed a bug that sometimes prevented navigation in the hideout stash while using a controller.</li>\n<li>Fixed a bug that prevented player 2 from using the Salvage Bench in couch co-op.</li>\n<li>Fixed a bug that prevented player 2 from equipping cosmetics in couch co-op.</li>\n<li>Fixed a bug that caused some types of specialised stash tab to fail to display when accessed by both players at the same time in couch co-op.</li>\n<li>Fixed a bug preventing the toggling of advanced descriptions while investigating an item.</li>\n<li>Fixed a bug preventing moving a socketed support gem into a different socket when you are close to your support gem limit.</li>\n<li>Fixed a bug where the \"Enable Held Targeting\" option did not function for crossbow ammunition skills.</li>\n<li>Fixed a bug where certain skills would not be performed if used while holding down a different skill's input.</li>\n\n</ul><br>\n<strong>Console Improvements</strong><br>\n<br>\n<ul>\n<li>Item filters can now be used on consoles by subscribing to a filter on the Path of Exile website.</li>\n<li>A link to set up an item filter is now provided in the filter section of the settings menu, under the Game tab.</li>\n<li>Fixed a bug where cutscenes and informational videos had incorrect colour grading on XBox series consoles with HDR enabled.</li>\n\n</ul><br>\n<strong>Localisation Fixes</strong><br>\n<br>\n<ul>\n<li>Fixed a number of cases of outdated translations</li>\n<li>Fixed characters with accents not displaying correctly in some languages.</li>\n<li>Fixed a number of cases where translated text could overlap itself or the borders of its field.</li>\n<li>Fixed a bug where Thai text did not display correctly on consoles.</li>\n<li>Fixed a bug where modifier tiers would not be displayed correctly when the game language was set to Traditional Chinese.</li>\n<li>Fixed a number of cases of keywords not displaying correctly in languages other than English.</li>\n\n</ul><br>\n<strong>Microtransactions</strong><br>\n<br>\n<ul>\n<li>Enabled the following existing cosmetic microtransactions for use in Path of Exile 2: Siren Wings, Siren Cloak, Siren Weapon, Siren Weapon Effect, Siren Character Effect, Siren Footprints Effect, Siren Portal Effect, Deepwater Wings, Deepwater Back Attachment, Deepwater Weapon, Deepwater Weapon Effect, Deepwater Character Effect, Deepwater Footprints Effect, Deepwater Portal Effect, Atlantis Cloak, Atlantis Wings, Atlantis Portal Effect, Atlantis Footprints Effect, Onyx Oblivion Wings, Onyx Oblivion Weapon, Oblivion Weapon, Direblade Wings, Direblade Weapon, Verdant Weapon, Sulphurous Gargoyle Wings, Alabaster Gargoyle Wings, Stygian Gargoyle Wings, Pitch-black Gargoyle Wings, Illusionist Character Effect, Brimstone Character Effect, Harmony Wings, Harmony Cloak, Harmony Weapon Effect, Harmony Footprints Effect, Harmony Portal Effect, Heritage Wings, Heritage Cloak, Heritage Weapon Effect, Heritage Weapon, Heritage Portal Effect, Divergence Wings, Divergence Cloak, Divergence Weapon, Divergence Weapon Effect, Divergence Footprints Effect, Divergence Character Effect, Divergence Portal Effect, Vulcan Cloak, Vulcan Shield, Vulcan Weapon Effect, Harmonious Weapon, Harmonious Weapon Effect, Electroswarm Character Effect, Project Electroswarm Character Effect, Siren Electroswarm Character Effect, Void Emperor Electroswarm Character Effect, Kalguuran Cloak, Penance Back Attachment, Crucible Armour Set, Cane Toad King Portal Effect, Albino Toad King Portal Effect, River Toad King Portal Effect, Sacred Wisps Portal Effect.</li>\n<li>The Hands of Xesht Back Attachment now has a smaller variant that can be selected from the cosmetics menu.</li>\n</ul>",
    "author": "Kieren_GGG",
    "replies": 418,
    "lastReplyBy": "tanasij#6202",
    "lastReplyDate": "Jan 29, 2025, 8:15:37 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3687868",
    "title": "0.1.0f Hotfix 3",
    "date": "Jan 9, 2025, 10:38:13 PM",
    "url": "https://www.pathofexile.com/forum/view-thread/3687868",
    "content": "<h3>0.1.0f Hotfix 3</h3><br>\n<ul>\n<li>Fixed a bug where the Corrupted Skill Gem Level Modifier wasn't applying.</li>\n<li>Fixed a bug where inherent Weapon Skills weren't showing when linked in chat or trade windows.</li>\n<li>Fixed a client crash related to Power Siphon.</li>\n<li>Fixed a buffer underflow client crash.</li>\n</ul><br>\nThis patch has been deployed without restarting the servers, you will need to restart your client to receive the client changes in this patch.",
    "author": "Kieren_GGG",
    "replies": 211,
    "lastReplyBy": "Galileo68#2080",
    "lastReplyDate": "Jan 16, 2025, 9:47:13 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3686954",
    "title": "0.1.0f Hotfix 2",
    "date": "Jan 9, 2025, 8:59:43 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3686954",
    "content": "<h3>0.1.0f Hotfix 2</h3><br>\n<ul>\n<li>Fixed a bug introduced in Patch 0.1.0f where players could lose Life or Energy Shield from actions such as using flasks.<br>\n</li>\n</ul><br>\nThis fix applies to new instances.",
    "author": "Kieren_GGG",
    "replies": 136,
    "lastReplyBy": "sXe_Stobie#6767",
    "lastReplyDate": "Jan 11, 2025, 5:00:05 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3686635",
    "title": "0.1.0f Hotfix 1",
    "date": "Jan 9, 2025, 4:15:43 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3686635",
    "content": "<h3>0.1.0f Hotfix</h3><br>\n<ul>\n<li>Adjusted thread priorities to reduce CPU over-utilization. This can help prevent crashes under specific circumstances.</li>\n<li>Fixed a client crash that could occur in Ultimatums.</li>\n</ul><br>\nThis patch has been deployed without restarting the servers. You will need to restart your client to receive the client changes in this patch.",
    "author": "Kieren_GGG",
    "replies": 176,
    "lastReplyBy": "ruivo33#1461",
    "lastReplyDate": "Jan 19, 2025, 9:58:13 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3686378",
    "title": "0.1.0f Patch Notes (restartless)",
    "date": "Jan 9, 2025, 12:20:30 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3686378",
    "content": "<h3>0.1.0f Patch Notes</h3><br>\n<ul>\n<li>Fixed a bug where Rare monsters could pause Delirium mist for an extended period of time, even before touching the Mirror of Delirium. This could result in opening a mirror and having no monsters spawn, or the mist not expanding fully. In addition, Delirium mist is now paused for 10 seconds when opening a Strongbox (previously 5). <em>Note that unrelated to Delirium Mist, further changes to Strongboxes will be made in an upcoming patch to make them less terrible.</em></li>\n<li>Fixed a bug where \"increased effect of small Passive Skills in Radius\" on Time-Lost Jewels was affected by increases and reductions to modifier effect, such as through The Adorned Unique Jewel.</li>\n<li>Fixed a bug where if a player changed their maximum life, energy shield or mana (such as through equipping and unequipping items) their current life, energy shield, mana, overcapped mana, or overcapped energy shield would also increase.</li>\n<li>Fixed a bug where overcapped life from Life Remnants would be erased whenever maximum life changed (such as from levelling up or weapon swapping).</li>\n<li>Fixed a bug where the projectiles of Zalmarath, the Colossus' knife attack were incorrectly positioned on top of the player.</li>\n<li>Fixed a bug where aftershocks of Rolling Slam were not dealing damage.</li>\n<li>Fixed a bug where Ritual Altars could sometimes fail to activate.</li>\n<li>Fixed a bug where Xesht, We That Are One could sometimes endlessly throw hands.</li>\n<li>Fixed a bug where the Mad Wolf of Ogham quest could be incompletable if you travelled to Act 2 by other means than talking to The Hooded One.</li>\n<li>Fixed a bug where many Precursor Tablet modifier descriptions did not display when hovering over Maps in radius of the completed Tower.</li>\n<li>Fixed a client crash that could occur after entering Demon Form while fighting Zarokh, the Temporal.</li>\n<li>Fixed a client crash that could occur with Fiery Death Support in party-play.</li>\n<li>Fixed a client crash that could occur on PlayStation 5.</li>\n</ul><br>\nThis patch has been deployed without restarting the servers. You will need to update your client to receive the client changes in this patch.",
    "author": "Kieren_GGG",
    "replies": 355,
    "lastReplyBy": "Dmeacp#7617",
    "lastReplyDate": "Jan 16, 2025, 1:49:03 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3683685",
    "title": "0.1.0e Hotfix 7",
    "date": "Jan 7, 2025, 1:24:52 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3683685",
    "content": "<h3>0.1.0e Hotfix 7</h3><br>\n<ul>\n<li>Fixed a bug that could cause some characters to be disconnected, most notably when trying to use the Demon Form skill granted by the Demonic Possession Infernalist Ascendancy Passive Skill.</li>\n<li>Fixed a visual bug with item deferral cost in Ritual.</li>\n<li>Fixed a client crash.</li>\n</ul><br>\n<br>\nYou will need to restart your client to receive the client changes from this patch. The Demon Form disconnection fix applies to new instances.",
    "author": "Kieren_GGG",
    "replies": 273,
    "lastReplyBy": "onenutt#2549",
    "lastReplyDate": "Jan 12, 2025, 12:41:07 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3682380",
    "title": "0.1.0e Hotfix 6",
    "date": "Jan 6, 2025, 6:03:40 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3682380",
    "content": "<h3>0.1.0e Hotfix 6</h3><br>\n<ul>\n<li>Fixed a bug where allocating Chaos Inoculation would incorrectly count you as being on Low Life.</li>\n</ul>",
    "author": "Kieren_GGG",
    "replies": 252,
    "lastReplyBy": "Cursedfly#5363",
    "lastReplyDate": "Jan 9, 2025, 11:48:50 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3677329",
    "title": "0.1.0e Hotfix 5",
    "date": "Jan 2, 2025, 10:26:28 PM",
    "url": "https://www.pathofexile.com/forum/view-thread/3677329",
    "content": "<h3>0.1.0e Hotfix 5</h3><br>\n<ul>\n<li>You can no longer use the instance manager to create multiple instances of the Trial of the Sekhemas.</li>\n</ul>",
    "author": "Stacey_GGG",
    "replies": 432,
    "lastReplyBy": "britnibrown1984#3108",
    "lastReplyDate": "Feb 4, 2025, 4:56:54 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjo1NzIsInNpemUiOiJhdmF0YXIifV0/da0980dacf/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3650268",
    "title": "0.1.0e Hotfix 4",
    "date": "Dec 19, 2024, 9:32:21 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3650268",
    "content": "<h3>0.1.0e Hotfix 4</h3><br>\n<ul>\n<li>Volcanic Fissure Aftershocks can no longer create Jagged Ground.</li>\n<li>Fixed a bug where characters who hadn't completed the campaign could enter endgame areas through other players hideouts.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 249,
    "lastReplyBy": "Valkaneer#5171",
    "lastReplyDate": "Jan 6, 2025, 4:48:05 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3647079",
    "title": "0.1.0e Hotfix 3",
    "date": "Dec 18, 2024, 8:27:44 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3647079",
    "content": "<h3>0.1.0e Hotfix 3</h3><br>\n<ul>\n<li>Fixed 4 instance crashes.</li>\n<li>Take 2, fixed a bug where certain rare monsters would respawn at checkpoints after Culling them with Lightning Warp.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 100,
    "lastReplyBy": "TheDon169#3221",
    "lastReplyDate": "Feb 3, 2025, 7:01:39 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3646886",
    "title": "0.1.0e Hotfix 2",
    "date": "Dec 18, 2024, 6:56:41 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3646886",
    "content": "<h3>0.1.0e Hotfix 2</h3><br>\n<ul>\n<li>Fixed a bug where Shapeshift Weapon Set points weren't applying in instances after allocating them.</li>\n<li>Fixed a bug introduced in patch 0.1.0e where the Spell Gem Level from the Demon Form buff did not apply unless you resocketed affected gems.</li>\n<li>Fixed unintentionally lowering the base minion critical damage bonus from +50% to +30% in patch 0.1.0e. We have buffed base minion critical damage bonus to be +100% (higher than pre 0.1.0e values) to match the base player critical damage bonus. This will display incorrectly in the character panel until a later patch.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 33,
    "lastReplyBy": "tweak#8062",
    "lastReplyDate": "Dec 26, 2024, 8:24:37 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3646074",
    "title": "0.1.0e Hotfix 1",
    "date": "Dec 18, 2024, 2:48:25 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3646074",
    "content": "<h3>0.1.0e Hotfix 1</h3><br>\n<ul>\n<li>Fixed a bug where Unearth wasn't raising temporary minions in some cases.</li>\n<li>Fixed an instance crash with Totem skills.</li>\n<li>Fixed an instance crash with Wind Dancer.</li>\n<li>Fixed an instance crash with Lightning Warp.</li>\n<li>Fixed an instance crash in Trial of the Sekhamas.</li>\n<li>Fixed a bug where the Passive Skill Notable 'Ancient Aegis' didn't work.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 75,
    "lastReplyBy": "Samsmzo#0366",
    "lastReplyDate": "Dec 27, 2024, 5:03:19 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3645467",
    "title": "0.1.0e Patch Notes",
    "date": "Dec 17, 2024, 11:00:57 PM",
    "url": "https://www.pathofexile.com/forum/view-thread/3645467",
    "content": "<h3>0.1.0e Patch Notes</h3><br>\n<strong>General Improvements and Changes</strong><br>\n<ul>\n<li>Added the capacity to fast-travel between Checkpoints within an area. You can now select checkpoints which will bring up your Map Overlay allowing you to select other Checkpoints you have discovered in the area to travel to them immediately. Many more checkpoints have been added to areas generally at all the entrances and exits to areas, meaning if you find those first, you are able to instantly travel to them if you choose to go back and explore an area.</li>\n<li>Passive Point Respeccing has been made cheaper especially at higher levels, it had a relatively aggressive curve getting more expensive with character level, we have flattened that curve so it doesn't exponentially grow as much. For Example, this should generally result in an approximately 40-50% less Gold Cost for respeccing between the start and middle of Endgame progression.</li>\n<li>Added a shortcut to open a skills advanced information display by right-clicking the skill on your Skill Bar.</li>\n<li>You can now compare equipped Flasks when using a Gamepad.</li>\n<li>Added Chance Shards to the Currency Exchange.</li>\n<li>Added a button to travel to your Guild Hideout when interacting with the Waypoint.</li>\n</ul><br>\n<strong>Endgame and Monster Balance</strong><br>\n<ul>\n<li>Maps no longer have additional elemental resistance penalties inherently applied at Tier 6 and Tier 11 or higher Maps. It is now consistent across all of the Endgame at the same value as it was previously at Tier 1.</li>\n<li>Critical Strikes from Monsters now deal 40% less bonus Damage.</li>\n<li>Chaos Damage now scales less aggressively over the Endgame.</li>\n<li>The Ground Laser and Ground Lightning abilities used by the Runed Knight in Expedition Encounters now deal substantially less Damage.</li>\n<li>The Waystone Modifier that adds Burning Ground to your Maps no longer increases in coverage or area with higher Tier Waystones.</li>\n<li>The 'Siphons Flask Charges Modifier' on Monsters now drains ten-times less Flask Charges per second. (This was unintentional).</li>\n<li>Disabled the Volatile Crystals Modifier, to be revised in the future pending telegraphing improvements.</li>\n<li>The Trail of Fire monster Modifier now deals 30% less Damage and lasts for 3 seconds (from 5 seconds).</li>\n<li>The Trail of Lightning monster Modifier now lasts for 4 seconds (from 8 seconds).</li>\n<li>The Trail of Ice monster Modifier now lasts for 4 seconds (from 8 seconds).</li>\n<li>The Purple Explosives created by the Volatile Plants Modifier on Rare Monsters now deal significantly less Damage.</li>\n<li>Packs of Prowling Chimeral's in Maps now contain less of the Prowling Chimerals and spawn alongside some Zombies.</li>\n<li>Lowered the baseline monster density of Breach Encounters, primarily by reducing the frequency of the \"Elite\" monsters appearing.</li>\n<li>Fixed an inconsistency in the different types of packs that could spawn during Breach Encounters, you should now see more different types of Monsters appearing on an area to area basis.</li>\n<li>The volatiles spawned by the Volatile Fiends Trial of Chaos Modifier now accelerate over time.</li>\n<li>The Stormcaller Runes Trial of Chaos Modifier are now smaller, take longer to charge up when standing inside and give more time to escape once triggered. The Runes now also get larger as the Modifier is upgraded.</li>\n<li>Improved the hitboxes on a number of abilities used by Blackjaw, the Remnant.</li>\n<li>The Crossbow variants of the Decrepit Mercenary monsters that dealt Fire damage now deal less damage.</li>\n</ul><br>\n<strong>Trial of the Sekhamas Improvements</strong><br>\n<ul>\n<li>Honour Damage now scales down based on distance to enemies, you now take up to 35% less Honour Damage when in close range, tapering as you are further away from Monsters.</li>\n<li>Fixed a bug where Damage over Time was dealing three-times as much damage to Honour as intended in the Trial of the Sekhemas, and fixed a bug where Honour Resistance was only applying to two-thirds of that damage taken. (This got confusing for us too).</li>\n<li>Skitter Golems no longer use basic attacks and instead now just explode as their attacks were largely unavoidable when in Melee Range.</li>\n<li>Serpent Clan burrow and ambush attacks now have improved visual telegraphing and cannot be used from as far away.</li>\n<li>Volcanoes created by Rattlecage's Fissure Slam now last half the duration.</li>\n<li>Added keyword hover for the Honour mechanic in the Trial of the Sekhamas.</li>\n</ul><br>\n<strong>Skill Balance</strong><br>\n<ul>\n<li>Rolling Slam's Second Slam now deals 50% more Damage to Heavy Stunned Enemies</li>\n<li>Ice Shot Shards (Secondary) now gains additional Projectiles as it Levels up</li>\n<li>Ice Shot Shards now targets within 90 Degree Cone</li>\n<li>Ice Shot Shards now travel further base (200ms, from 100ms), to be tested &amp; iterated.</li>\n<li>Ice Shot Arrow &amp; Projectiles are now smaller and are the same size as other arrows.</li>\n<li>Electrocuting Arrow Base Duration to 25 seconds (from 12), Doubling Quality Bonus also.</li>\n<li>Barrage now has 25% Less damage on Barraged Attacks [From 60% Less] at Level 1, same Scaling Per Level.</li>\n<li>Barrage now has +2 Repeats base, from +1.</li>\n<li>Shockchain Arrow's Shockwaves now deal 100% more Damage.</li>\n<li>Sniper's Mark cooldown reduced from 6 seconds to 2 seconds at all Levels.</li>\n<li>Combat Frenzy now can now gain a Frenzy Charge no more than every 3 seconds (from 7 seconds) at Level 1, to approximately 1.5 seconds at Level 20.</li>\n<li>Stormcaller Arrow's Bolt now gains additional Impact Radius as it Levels.</li>\n<li>Vine Arrow's Damage over Time has been adjusted, it is now slightly higher at Lower Levels, and substantially lower at Higher Levels. The intention of this ability was that you poison it to spread poisons, as opposed to the vine itself dealing immense amounts of Damage.</li>\n<li>Tornado Shot's Damage over Time has been adjusted, it is now slightly higher at Lower Levels, and substantially lower at Higher Levels. The intention of this ability was to propagate your other Bow skills, as opposed to doing an immense amount of damage itself.</li>\n<li>Magnetic Salvo can now only use your stuck Lightning Arrows as opposed to those created by your Party Members.</li>\n<li>Increased the damage growth per level on Unearth (non-Minion component), Bonestorm, Bone Cage, Bone Blast (Wand Skill) and Power Siphon (Wand Skill). Results in approximately 50% more damage at Gem Level 25.</li>\n<li>Increased the damage growth per level on Essence Drain, Contagion, Profane Ritual and Chaos Bolt (Wand Skill). Results in approximately 33% more damage at Gem Level 25.</li>\n<li>Bone Cage base Critical Strike Chance has been increased to 15% (from 13%).</li>\n<li>Skeleton Arsonists' Spirit Costs now match Frost and Ice Mages from Level 5 onwards, making them more expensive while keeping their costs early-game the same.</li>\n<li>Bone Offering Explosions now have 15% Critical Strike Chance (from 13%).</li>\n<li>Resonating Shield, Shield Charge and Shield Wall now have 6-8 added Physical Damage per 15 Armour on your Shield at all Levels.</li>\n<li>Resonating Shield radius increased to 2.3 metres (from 1.8 metres).</li>\n<li>Shield Wall explosions increased to 4 metres (from 2 metres).</li>\n<li>Shield Wall now can create a maximum of 2 walls (from 1 wall).</li>\n<li>Siege Cascade now has an Attack Time of 75% (from 55%).</li>\n<li>Siege Cascade now searches for targets in a 3.5 metre radius (from 2.5 metres)</li>\n<li>Siege Cascade now has 50% more Damage against Immobilized Enemies (from 200%)</li>\n<li>Siege Cascade's Explosion now deals 167% more Damage (accounting for the decrease in damage against Immobilized Enemies).</li>\n<li>Siege Cascade now has 30% less Reload Speed (from 50% less).</li>\n<li>Siege Cascade's Quality is now 2% Damage against Immobilized Enemy per Quality (from 4%).</li>\n<li>Stormblast Bolts now has a maximum of 30 active Bolts (from 9).</li>\n<li>Stormblast Bolts now has 5 Bolts in the Clip (from 3).</li>\n<li>Stormblast Bolts now has 30% less Reload Speed (from 50% less).</li>\n<li>Plasma Blast now has 47% more Damage with its Initial Hit and 25% less Damage with its Explosion, causing it to rely less on colliding with walls to deal enough damage.</li>\n<li>Artillery Ballista's explosion radius increased to 1.8 metres (from 1.4 metres).</li>\n<li>Artillery Ballista's Damage increased by approximately 21%.</li>\n<li>Gathering Storm's Perfect Dash now deals 53% more Damage.</li>\n<li>Wave of Frost now has 275% more Freeze Buildup at all Levels (from 150% scaling up over levels).</li>\n<li>Staggering Palm's duration now scales with levels. It has 6 second duration at Level 1, scaling up by 0.2 seconds per Level (from 6 seconds at all Levels).</li>\n<li>Staggering Palm's Projectiles now deal 20% more Damage at all Levels.</li>\n<li>Concoction skills from the Pathfinder Ascendancy Class now consume 3 charges from Mana Flasks (from 5). Their damage has been increased and deal approximately 66% more Damage when the skill is Level 20. In addition the base added damage has been increased by at least 50% for all Concoction skills, with Poisonous and Bleeding Concoction receiving greater damage buffs. Fulminating Concoction now has a Critical Strike Chance of 8% (from 6%), Shattering Concoction now has a Critical Strike Chance of 11% (from 7%), Explosive Concoction now has 100% more chance to Ignite Enemies and 100% more magnitude of Ignites inflicted, Fulminating Concoction now has 100% more chance to inflict Shock and Shattering Concoction now has 100% more Freeze Buildup.</li>\n<li>The Hunter's Talisman passive skill Notable now grants +1 Charm Slot. The small passive skills leading up to it now grant the stat it formerly gave. The Charm helper text has been updated to indicate that you cannot have more than three Charm Slots unlocked, so that we can add more sources of it in the future.</li>\n<li>Added a new Lightning Damage and Electrocute Cluster to the passive tree in between the Ranger and Monk sections.</li>\n<li>The Heavy Frost Notable Passive Skill now causes Hits to only ignore Enemy Resistances of Frozen Enemies if their resistance values were positive.</li>\n<li>Supercharged Slam now builds up stages slower but gains 40% more Damage per Stage now (from 20%). This may display as 20% still incorrectly until a later patch.</li>\n<li>Electrocute is now 25% harder to Buildup. (But the Damage Penalty has been removed from the Support Gem)</li>\n<li>It is now more difficult to chain-freeze enemies, by reducing the amount of Freeze Buildup applied after a Freeze has been applied.</li>\n<li>Added a marker effect to Ember Fusillade's preferred target.</li>\n</ul><br>\n<strong>Support Balance</strong><br>\n<ul>\n<li>Added the Tremors Support Gem. Which can be used to give up to multiple more Aftershocks to Skills, with a damage penalty.</li>\n<li>Added the Bidding Support Gem. Which can be used to give more damage to the Command Skills of Supported Minions.</li>\n<li>The Fire Exposure, Lightning Exposure and Cold Exposure Support Gems no longer penalize Damage of Supported Skills. They now have a Mana Cost Multiplier of 120%.</li>\n<li>The Electrocute Support no longer penalizes Damage. Instead it now prevents the Supported Skill from being able to Shock.</li>\n<li>The Lacerate Support now grants 50% chance to Bleed (from 30%).</li>\n<li>The Envenom Support now grants 50% chance to Poison (from 60%).</li>\n<li>The Impact Shockwave Support now has an aftershock radius of 2 metres (from 1.4 metres).</li>\n<li>The Bidding Support now grants 30% more Damage to Minion Command Skills (from 20%).</li>\n<li>The Considered Casting Support now only supports Spells you cast yourself. It also now grants 40% more Spell Damage (from 25%) and 15% less Cast Speed (from 10%).</li>\n<li>The Aftershock Support now has 25% chance to cause an Aftershock (from 20%).</li>\n<li>The Mobility Support no longer has a Damage Penalty, but applies 30% less Movement Speed Penalty (from 40%).</li>\n<li>The Execrate Support now has 100% chance to inflict Ailments (from 50%).</li>\n<li>The Ricochet Support now has 40% chance to Chain from Terrain (from 20%).</li>\n<li>The Withering Touch Support now has 25% less Damage (from 50%).</li>\n<li>The Ferocity Support now has 40% more Skill Speed when consuming a Frenzy Charge (from 30%).</li>\n<li>Changed the Wildshards Support Gem to fire projectiles in a Circle instead of a Spiral pattern.</li>\n<li>The Decaying Hex Support now deals 60% of Intelligence as Chaos Damage per Second (from 30%).</li>\n<li>The Stomping Ground Support's Shockwave now deals 80% to 120% of your Strength as Physical Damage (from 20 to 30%).</li>\n</ul><br>\n<strong>Item Balance</strong><br>\n<ul>\n<li>The Charm Modifiers on Belts have been made substantially more common and now appear at much lower levels. The 'of Symbolism' Modifier now appears from level 23 onwards, and the 'of Inscription' Modifier now appears from level 64 onwards.</li>\n<li>The unique item The Adorned now applies to Time-Lost Jewels.</li>\n<li>The Time-Lost Jewel Modifier 'of Regeneration' now applies 3-7% increased Life Regeneration Rate to Notables in Radius, from 1-2%. Existing versions of this item will not be updated unless a Divine Orb is used.</li>\n</ul><br>\n<strong>Bug Fixes</strong><br>\n<ul>\n<li>Fixed a bug where the Unique Item Maligaro's Virtuosity was granting the wrong amount of Critical Damage.</li>\n<li>Fixed a bug where the Crumbling Walls Atlas Passive Notable was applying to Maps that didn't contain Breaches.</li>\n<li>Fixed a bug where the stat granted by the Organized Forces Atlas Passive Notable was causing less Waystones to drop due to trying to upgrade them to a Tier that didn't exist.</li>\n<li>Fixed a bug where interactables would remove the player from Demon Form. </li>\n<li>Fixed a bug where certain rare monsters would respawn at checkpoints after consuming their corpse.</li>\n<li>Fixed a bug where leveling a skill gem incorrectly displayed the level change when it was supported by gems which granted additional skill levels. This was purely a visual issue.</li>\n<li>Fixed a bug where Unearth didn't work with the Sacrifice Spirit Gem.</li>\n<li>Fixed a bug where the Elemental Expression skill from the Invoker Ascendancy Class had an incorrect hitbox.</li>\n<li>Fixed a bug where the Monk Ascendancy node 'Embrace the Darkness' would desync when losing Life and Energy Shield. </li>\n<li>Fixed a bug which prevented party members from entering the Xesht fight once it had begun.</li>\n<li>Fixed a bug where the Cosmetics Equipment UI was missing the tier selector for some slots.</li>\n<li>Fixed a bug where the Trialmaster encounter dialogue failed to play.</li>\n<li>Fixed a bug with the Rising Tempest Support where it was giving More Damage per Elemental Skill used rather than More Damage per Elemental Type that was used.</li>\n<li>Fixed a bug where pathfinding could cause jittering of the character in some cases. </li>\n<li>Fixed a bug where destroying items in hideouts wasn't possible.</li>\n<li>Fixed a bug where Frost Wall segments could leave phantom walls, causing invisible blocking. </li>\n<li>Fixed a bug where implicit abilities on non-weapon unique items required a low level to use.</li>\n<li>Fixed a bug where the Chronomancers 'Debuff Expiry Rate' nodes were applying to Quicksand Hourglass, extending its cooldown.</li>\n<li>Fixed a bug where Ember Fusillade could fail to target enemies.</li>\n<li>Fixed a bug where the Sacrifice Spirit Gem couldn't target minions with Profane Ritual.</li>\n<li>Fixed a bug where the Explosion from the Armour Explosion Support could explode inanimate objects.</li>\n<li>Fixed a bug where some Spirit Gems displayed an incorrect error message.</li>\n<li>Fixed a bug where the Arbiter of Ash area level wasn't being increased with difficulty.</li>\n<li>Fixed a bug where Emergency Reload wasn't put on cooldown if you were using two Emergency Reload Skill Gems.</li>\n<li>Fixed a bug where the Energizing Bolt Flask effect didn't work.</li>\n<li>Fixed a crash on Gamepad where Concoction skills from the Pathfinder Ascendancy Class would cause a crash when changing areas.</li>\n<li>Fixed a bug where some players would disconnect when trying to enter maps in the Ziggurat Refuge, or guild hideouts while in a party.</li>\n<li>Fixed a bug where the Explosion from the Armour Explosion Support could trigger itself recursively.</li>\n<li>Fixed a bug where Ice Shot was unable to cause Freeze buildup.</li>\n<li>Fixed a bug where some volatiles in the Trial of Chaos would follow the player up elevators.</li>\n<li>Fixed a bug where Inscribed Ultimatums and Djinn Baryas dropped in Cruel would incorrectly tell you that you could get Ascendancy Points by completing them, even if you wouldn't.</li>\n<li>Fixed a bug where Ballista skills didn't work with Tornadoes created by Tornado Shot.</li>\n<li>Fixed a bug when using a Gamepad where the Hide Sockets option did not work.</li>\n<li>Fixed a bug when using a Gamepad where you couldn't see Distilled Emotion recipes on the passive tree.</li>\n<li>Fixed a bug when using a Gamepad where you couldn't access the Portal Access settings while viewing the hideout stash.</li>\n<li>Fixed a bug where creating Solo Self-Found characters wasn't possible when using a Gamepad while Migrations are disabled.</li>\n<li>Fixed a bug when using a Gamepad where you couldn't use the shortcut bind to open chat.</li>\n<li>Fixed a bug when using a Gamepad that caused it to take multiple attempts to change the tier selector of Microtransactions.</li>\n<li>Fixed a bug when using a Gamepad where you couldn't set an individual price on an item in premium stash tabs.</li>\n<li>Fixed a bug when using a Gamepad where you couldn't socket jewels into specific unique items.</li>\n<li>Fixed 12 Client Crashes.</li>\n<li>Fixed 3 Instance Crashes.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 733,
    "lastReplyBy": "Thiago_Bones#9530",
    "lastReplyDate": "Jan 2, 2025, 8:04:18 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3634784",
    "title": "0.1.0d Hotfix 5",
    "date": "Dec 14, 2024, 10:55:46 PM",
    "url": "https://www.pathofexile.com/forum/view-thread/3634784",
    "content": "<h3>0.1.0d Hotfix 5</h3><br>\n<ul>\n<li>Fixed a bug where The Trail of Corruption quest in Act 2 could fail to progress when clearing the Sandstorm if you disconnected during it's animation. Those who were progression blocked by this should be able to use the marker to trigger this event again.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 151,
    "lastReplyBy": "slayersichi#0486",
    "lastReplyDate": "Dec 18, 2024, 1:29:02 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3631452",
    "title": "0.1.0d Hotfix 4",
    "date": "Dec 14, 2024, 3:17:28 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3631452",
    "content": "<h3>0.1.0d Hotfix 4</h3><br>\n<ul>\n<li>Fixed a bug where the Arbiter Atlas Tree notable stats weren't correctly applying to the area.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 83,
    "lastReplyBy": "eclap78#2642",
    "lastReplyDate": "Dec 19, 2024, 12:13:07 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3631349",
    "title": "0.1.0d Hotfix 3",
    "date": "Dec 14, 2024, 2:34:06 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3631349",
    "content": "<h3>0.1.0d Hotfix 3</h3><br>\n<ul>\n<li>Fixed two instance crashes.</li>\n<li>Fixed a bug where Summon Raging Spirits failed to cleanup on death when they were killed on the same frame they were created.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 30,
    "lastReplyBy": "roachmanley#2097",
    "lastReplyDate": "Dec 16, 2024, 6:32:46 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3627221",
    "title": "0.1.0d Hotfix 2",
    "date": "Dec 13, 2024, 4:12:33 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3627221",
    "content": "<h3>0.1.0d Hotfix 2</h3><br>\n<ul>\n<li>Fixed a bug which prevented the elevator at end of The Trial of Chaos from working to access the Trialmaster Boss.</li>\n<li>Fixed a bug which could prevent the Portal from appearing on Floor 4 of Trial of the Sekhamas.</li>\n</ul><br>\n<br>\nThis patch has been deployed without restarting the servers. You will need to restart your client to receive the client changes in this patch.",
    "author": "Jeff_GGG",
    "replies": 290,
    "lastReplyBy": "Jakestation#5003",
    "lastReplyDate": "Dec 16, 2024, 10:24:49 PM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3621780",
    "title": "0.1.0d Hotfix 1",
    "date": "Dec 12, 2024, 4:37:28 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3621780",
    "content": "<h3>0.1.0d Hotfix 1</h3><br>\n<ul>\n<li>We missed one! Cast on Critical Strike now also cares about the Damage of the hit when determining how much energy to gain to prevent the use of high-crit low level skills, this should mean using lower hit frequency skills that hit harder are also now much stronger for this.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 757,
    "lastReplyBy": "Espirituo#3071",
    "lastReplyDate": "Dec 16, 2024, 9:06:28 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3621299",
    "title": "0.1.0d Patch Notes",
    "date": "Dec 12, 2024, 1:47:51 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3621299",
    "content": "<h3>0.1.0d Patch Notes</h3><br>\n<strong>General Improvements and Changes</strong><br>\n<br>\n<ul>\n<li>Passive Block chance now applies to blockable hits from all directions, as opposed to just hits from in front.</li>\n<li>Player size is now set to Zero units while dodge rolling instead of One unit.</li>\n<li>Some smaller monsters can now be pushed while dodge rolling. This includes monsters such as the Adorned Beetles in Keth.</li>\n<li>Inscribed Ultimatums and Djinn Baryas now display whether you will obtain Ascendancy Skill Points upon completing the Trial of Chaos or Trial of the Sekhemas respectively.</li>\n<li>Removed World Map Pins for encounters that were not from specific locations in Areas. ie. From Monster drops.</li>\n<li>Improved attack in place behaviour.</li>\n<li>Rain of Arrows and Firestorm now have a hit-rate limit to prevent cases of them absolutely obliterating very large bosses. This will have little to no impact outside of boss fights with very large hitboxes.</li>\n<li>Leech has been buffed.</li>\n<li>Boneshatter now more reliably hits your target.</li>\n<li>The duration of Armour Break has been increased to 12 seconds (previously 6).</li>\n<li>To improve performance, Incinerate now creates circular areas of ignited ground instead of segments.</li>\n<li>Added CTRL+Click shortcut to open the Currency Exchange at the appropriate NPCs.</li>\n<li>Added a button to travel to the Trial of Chaos on the world map.</li>\n<li>Added art for Close Combat Support.</li>\n<li>Added 2D art for the Defiance of Destiny Unique Amulet.</li>\n<li>Added \"Ascendancy Skill Points\" as a keyword, which details how sets of Ascendancy Points are obtained.</li>\n<li>Added search functionality for Gemcutting and vendor inventories when using a controller. Keybinds for searching Stash on a controller have also been updated.</li>\n<li>Added Gemcutting restrictions option for Gamepad.</li>\n<li>Added suggested Supports for Time of Need.</li>\n<li>Updated the suggested Supports for Bonestorm.</li>\n<li>Added an option for opening the Trade website to the main menu for consoles.</li>\n<li>Runes now sell to vendors for more Gold.</li>\n<li>Updated art for Reserved Life and Mana.</li>\n<li>Updated the description on Runes to clarify that once socketed they cannot be replaced.</li>\n<li>Auras and Curses that affect ally or enemy resistances now display values in the Skill popout panel.</li>\n<li>Tweaked the audio of the Kiwi Pets, Chimera Pet, and Baby Crowbell Pet to reduce their impact in town areas.</li>\n<li>Updated the wording on the Invoker's \"...and Protect me from Harm\" Ascendancy Passive Skill to clarify its functionality.</li>\n<li>Updated the description on Hexblast to clarify that it only detonates a single Curse per Enemy in its radius.</li>\n<li>Updated the description on Fiery Death Support to clarify that the Supported Skill does not need to kill the ignited enemy itself.</li>\n<li>Reduced the defenses provided to monsters by the Magma Barrier modifier.</li>\n<li>Walking Goliaths no longer use their suicide attack if they are Rare.</li>\n</ul><br>\n<strong>Trigger Gems and Energy Gain</strong><br>\n<br>\n<ul>\n<li>Trigger gem energy gain was not in the right place and it was far too easy to use ailments to trigger spells. One problem with the previous system is that if we balanced it to make triggering happen in boss fights then the triggering would happen far too often during clearing. In order to address this we are now making \"Monster Power\" part of the calculation for energy gain. This means that it's far easier to trigger skills from Unique Monsters than it is from normal monsters, but you also hit many more normal monsters when fighting. Another issue was using low level skills with unconditional ailment applications such as Flame Wall to ignite enemies for triggering. In order to make the source of the ignite matter we are making the energy gain be dependent on the strength of the ignite. We have also rebalanced all energy gain across the board.</li>\n</ul><br>\n<strong>Ultimatum Changes</strong><br>\n<br>\n<ul>\n<li>Generally improved balance across the board with Ultimatum monsters, bosses and modifiers. Mostly targeting outliers that were too difficult and bringing them in line.</li>\n<li>The monster density of Ultimatum encounters has been made more consistent.</li>\n<li>Stormcaller Runes, Blood Globules, Heart Tethers and Impending Doom rings no longer spawn while a player is on a lift or near the altars in the Vaal Soul Core room.</li>\n<li>Fixed a bug where Player Minions could get stuck at the top of the lift in the Trials of Chaos.</li>\n</ul><br>\n<strong>Bug Fixes</strong><br>\n<br>\n<ul>\n<li>Fixed a bug which caused enemies to be Primed for Stun or Electrocute earlier than intended while in a party.</li>\n<li>Fixed a bug where Gemling Legionnaires with the Integrated Efficiency Ascendancy Passive Skill allocated could lose their 3 additional Skill Slots if they were empty when entering a new area.</li>\n<li>Fixed a bug with party member reviving when using WASD input where you could revive party members from too far away.</li>\n<li>Fixed a bug where \"Waystones found have a chance to be a tier higher\" on the Atlas Passive Tree wasn't working.</li>\n<li>Fixed a bug where the Audio Mix setting was not being remembered when restarting the game.</li>\n<li>Fixed a bug where one of the small Passive Skills in the Fleshcrafter cluster was not connected to the Notable Passive Skill. It is possible for your Passive Skill Tree to be reset if you had this cluster allocated, apologies!</li>\n<li>Fixed a bug where you could not open a portal in The Riverbank in Cruel difficulty.</li>\n<li>Fixed a bug where some of Zalmarath, the Colossus' skills could persist after their death.</li>\n<li>Fixed a bug where opening a full-screen panel while disenchanting could prevent you from performing any actions until you relogged.</li>\n<li>Fixed a bug where some fire spells, such as Volatile Dead and Incinerate, were not functioning correctly with Raging Spirits.</li>\n<li>Fixed a bug where \"Buffs on you expire Slower\" from the Prolonged Assault Notable Passive Skill and other Chronomancer Ascendancy Passive Skills was applying to Debuffs and other effects as well as Buffs.</li>\n<li>Fixed a bug where non-reviving Minions were spawning a Remnant from the Grim Feast Buff when dying in your presence.</li>\n<li>Fixed a bug Infernalists with the Pyromantic Pact Ascendancy Passive Skill allocated were considered to be on Low Infernal Flame if they were at 50% of Maximum Infernal Flame or lower, instead of 35%.</li>\n<li>Fixed a bug where the world map icon for Candlemass in Cruel was not updating correctly.</li>\n<li>Fixed a bug where you could be unable to upgrade Gems despite satisfying the Attribute Requirement by having the Adaptive Capability Gemling Legionnaire Ascendancy Passive Skill allocated.</li>\n<li>Fixed a bug where Fiery Death Support was not dealing damage correctly.</li>\n<li>Fixed Infusion Support Gems on Herald skills applying the gain damage as extra elemental damage to all attacks instead of just the damage from the Herald skill.</li>\n<li>Fixed a bug where Expedition encounters could fail to generate in the Decay Map.</li>\n<li>Fixed a bug where Quality on the Sacrifice Skill was causing Minions to Revive 0-5% more slowly, instead of more quickly.</li>\n<li>Fixed a bug where the exit portal for the final boss in Trial of the Sekhemas did not visually display upon killing the boss.</li>\n<li>Fixed a bug where socketed Skills you didn't meet the requirements for were missing their name in the Skills menu when using a controller.</li>\n<li>Fixed a bug where the Elemental Storm skill granted by the Stormweaver's Tempest Caller Ascendancy Passive Skill could sometimes place the storm underneath you.</li>\n<li>Fixed a snapshotting bug with the \"Loads an Additional Bolt\" Crossbow modifier.</li>\n<li>Fixed a bug where the Contagion Skill was not spreading Poison.</li>\n<li>Fixed a bug where Tempest Bell could become invisible.</li>\n<li>Fixed a bug where NPCs were missing their name labels in Hideouts when using a controller.</li>\n<li>Fixed a bug where signing into a guest account on PlayStation 5 could delete your friends list in-game.</li>\n<li>Fixed a bug where you could sometimes be unable to enter your hideout on PlayStation 5.</li>\n<li>Fixed eight instance crashes.</li>\n<li>Fixed six client crashes.</li>\n<li>Fixed a client crash that could occur on Xbox.</li>\n<li>Fixed three client crashes that could occur on PlayStation 5.</li>\n</ul>",
    "author": "Kieren_GGG",
    "replies": 1910,
    "lastReplyBy": "Hankier#4549",
    "lastReplyDate": "Jan 11, 2025, 11:01:03 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3617298",
    "title": "0.1.0c Hotfix 2",
    "date": "Dec 11, 2024, 6:24:59 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3617298",
    "content": "<h3>0.1.0c Hotfix 2</h3><br>\n<ul>\n<li>Demon form now has a minimum of 1 life lost per second, per stack.</li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 118,
    "lastReplyBy": "DeadAngel69#5772",
    "lastReplyDate": "Jan 22, 2025, 6:13:56 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3612268",
    "title": "0.1.0c Hotfix 1",
    "date": "Dec 10, 2024, 8:56:01 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3612268",
    "content": "<h3>0.1.0c Hotfix 1</h3><br>\n<ul>\n<li>Summon Raging Spirits now only summons 5 Raging Spirits per cast at all levels. The tooltip display will be updated in a future restart patch.</li>\n<li>Summon Raging Spirits can no longer be spawned from triggered Fire Skills. </li>\n</ul>",
    "author": "Jeff_GGG",
    "replies": 290,
    "lastReplyBy": "ponebolezney#5412",
    "lastReplyDate": "Dec 12, 2024, 10:21:24 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjowLCJzaXplIjoiYXZhdGFyIn1d/1cbf9cc398/Path_of_Exile_Gallery_Image.jpg"
  },
  {
    "id": "3611708",
    "title": "0.1.0c Patch Notes (restartless)",
    "date": "Dec 10, 2024, 5:36:19 AM",
    "url": "https://www.pathofexile.com/forum/view-thread/3611708",
    "content": "<h3>0.1.0c Patch Notes</h3><br>\n<ul>\n<li>Campaign bosses killed after the first kill will now drop less currency items, replacing them with other items.</li>\n<li>Increased the drop rate of Regal Orbs.</li>\n<li>Significantly increased the drop rate of Gemcutter's Prisms.</li>\n<li>A single Gemcutter's Prism also improves the Quality of a Skill Gem by +5% (previously +1%).</li>\n<li>Lowered the drop rate of Chaos Orbs and distributed it amongst the other more valued Currency Items (Like Regal Orbs, Exalted Orbs).</li>\n<li>Lowered the drop rate of Artificer's Orbs and distributed it to Lesser Jeweller's Orbs.</li>\n<li>Disenchanting Rare Items with 6 Modifiers now provides 2 Regal Shards (previously 1). The value displayed will still show as 1 until a later patch.</li>\n<li>Increased the values of all Prefix Modifiers that can roll on Waystones. We've also adjusted the chances of getting the more commonly powerful Modifiers such as increases to Rarity and Pack Size.</li>\n<li>Monster Modifiers now grant higher amounts of Item Rarity and Item Quantity. This is most common on Magic and Rare enemies, but also affects Unique Enemies if applied through various Endgame Mechanics like the Deadly Evolution Keystone.</li>\n<li>Increased the chance for Rare Monsters in Maps to have 3 or 4 modifiers.</li>\n<li>Rare Monsters in Map areas are now revealed on the minimap when there are 200 Monsters remaining (previously 50).</li>\n<li>Fixed a bug where some Persistent Buff Skills, such as Raging Spirits and Mana Remnants, were not working for the Infernalist when in Demon Form.</li>\n<li>Fixed a bug where you could sometimes be unable to interact with the Map Device in The Ziggurat Refuge.</li>\n<li>Fixed a bug where Monsters Shattered in a Blood Circle Ultimatum Encounter were not contributing blood.</li>\n<li>Fixed a bug that could cause the instance to permanently stop time (freeze) when trying to revive a Chronomancer.</li>\n<li>Fixed a bug where Rare Monsters could not be found within the Chimeral Wetlands.</li>\n<li>Fixed a bug where \"Move only\" was name-locking.</li>\n<li>Fixed three instance crashes.</li>\n<li>Fixed a client crash.</li>\n</ul><br>\nThis patch has been deployed without restarting the servers. You will need to restart your client to receive the client changes in this patch. <br>\n<br>\nConsoles also have almost all the changes here (except namelocking and a client crash fix) but will still show as 0.1.0b until we next update the client.",
    "author": "Kieren_GGG",
    "replies": 274,
    "lastReplyBy": "exile13#6211",
    "lastReplyDate": "Dec 17, 2024, 1:16:00 AM",
    "type": "patch-note",
    "imageUrl": "https://web.poecdn.com/gen/image/WzAsMSx7ImlkIjoyNCwic2l6ZSI6ImF2YXRhciJ9XQ/217ae4d1ca/Path_of_Exile_Gallery_Image.jpg"
  }
]